Paciente8159/uCNC/uCNC/src/hal/mcus/esp32s/mcumap_esp32s.h
/*
	Name: mcumap_esp32_sx.h
	Description: Contains all MCU and PIN definitions for Arduino ESP32-Sx to run µCNC.

	Copyright: Copyright (c) João Martins
	Author: João Martins
	Date: 10-03-2025

	µCNC is free software: you can redistribute it and/or modify
	it under the terms of the GNU General Public License as published by
	the Free Software Foundation, either version 3 of the License, or
	(at your option) any later version. Please see <http://www.gnu.org/licenses/>

	µCNC is distributed WITHOUT ANY WARRANTY;
	Also without the implied warranty of	MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
	See the	GNU General Public License for more details.
*/

#ifndef MCUMAP_ESP32_S_H
#define MCUMAP_ESP32_S_H

#ifdef __cplusplus
extern "C"
{
#endif

#include <Arduino.h>
#include "driver/timer.h"
#include "driver/gpio.h"
#include "soc/io_mux_reg.h"
#include "soc/gpio_sig_map.h"
#include "hal/gpio_ll.h"
#include "driver/adc.h"
#include "driver/ledc.h"

/*
	Generates all the interface definitions.
	This creates a middle HAL layer between the board IO pins and the AVR funtionalities
*/
/*
	MCU specific definitions and replacements
*/

/*
	ESP32-C Defaults
*/
// defines the frequency of the mcu
#ifndef F_CPU
#define F_CPU 160000000L
#endif
// defines the maximum and minimum step rates
#ifndef F_STEP_MAX
#define F_STEP_MAX 200000UL
#endif
#ifndef F_STEP_MIN
#define F_STEP_MIN 1
#endif

#define FORCE_HAL_IO_DIRECTION_ONREQUEST

#ifndef USE_CUSTOM_EEPROM_LIBRARY
#ifndef USE_ARDUINO_EEPROM_LIBRARY
#define USE_ARDUINO_EEPROM_LIBRARY
#endif
#endif

// defines special mcu to access flash strings and arrays
#define __rom__
#define __romstr__
#define rom_strptr *
#define rom_strcpy strcpy
#define rom_strncpy strncpy
#define rom_memcpy memcpy
#define rom_read_byte *

#define __ATOMIC__
#define __ATOMIC_FORCEON__

// needed by software delays
#ifndef MCU_CLOCKS_PER_CYCLE
#define MCU_CLOCKS_PER_CYCLE 1
#endif
#ifndef MCU_CYCLES_PER_LOOP
#define MCU_CYCLES_PER_LOOP 1
#endif
#ifndef MCU_CYCLES_PER_LOOP_OVERHEAD
#define MCU_CYCLES_PER_LOOP_OVERHEAD 0
#endif

#ifndef MCU_CALLBACK
#define MCU_CALLBACK IRAM_ATTR
#endif

#ifdef ENABLE_RX_SYNC
#define MCU_RX_CALLBACK ICACHE_FLASH_ATTR
#endif

#ifdef ENABLE_TX_SYNC
#define MCU_TX_CALLBACK ICACHE_FLASH_ATTR
#endif

#define MCU_IO_CALLBACK ICACHE_FLASH_ATTR

#ifdef RX_BUFFER_CAPACITY
#define RX_BUFFER_CAPACITY 255
#endif

#define __SIZEOF_FLOAT__ 4

// used by the parser
// this method is faster then normal multiplication (for 32 bit for 16 and 8 bits is slightly lower)
// overrides utils.h definition to implement this method with or without fast math option enabled
#define fast_int_mul10(x) ((((x) << 2) + (x)) << 1)

// PINNAMES for ESP32
#define PERIPHS_IO_MUX_GPIO0 (PERIPHS_IO_MUX + 0x34)
#define PERIPHS_IO_MUX_GPIO1 (PERIPHS_IO_MUX + 0x18)
#define PERIPHS_IO_MUX_GPIO2 (PERIPHS_IO_MUX + 0x38)
#define PERIPHS_IO_MUX_GPIO3 (PERIPHS_IO_MUX + 0x14)
#define PERIPHS_IO_MUX_GPIO4 (PERIPHS_IO_MUX + 0x3C)
#define PERIPHS_IO_MUX_GPIO5 (PERIPHS_IO_MUX + 0x40)
#define PERIPHS_IO_MUX_GPIO6 (PERIPHS_IO_MUX + 0x1c)
#define PERIPHS_IO_MUX_GPIO7 (PERIPHS_IO_MUX + 0x20)
#define PERIPHS_IO_MUX_GPIO8 (PERIPHS_IO_MUX + 0x24)
#define PERIPHS_IO_MUX_GPIO9 (PERIPHS_IO_MUX + 0x28)
#define PERIPHS_IO_MUX_GPIO10 (PERIPHS_IO_MUX + 0x2c)
#define PERIPHS_IO_MUX_GPIO11 (PERIPHS_IO_MUX + 0x30)
#define PERIPHS_IO_MUX_GPIO12 (PERIPHS_IO_MUX + 0x04)
#define PERIPHS_IO_MUX_GPIO13 (PERIPHS_IO_MUX + 0x08)
#define PERIPHS_IO_MUX_GPIO14 (PERIPHS_IO_MUX + 0x0C)
#define PERIPHS_IO_MUX_GPIO15 (PERIPHS_IO_MUX + 0x10)

	typedef struct
	{
		volatile uint32_t OUT;
		volatile uint32_t OUTSET;
		volatile uint32_t OUTCLR;
	} IO_OUT_TypeDef;

	typedef struct
	{
		volatile uint32_t IN;
	} IO_IN_TypeDef;

#define OUT0 ((IO_OUT_TypeDef *)GPIO_OUT_REG)
#ifdef GPIO_OUT1_REG
#define OUT1 ((IO_OUT_TypeDef *)GPIO_OUT1_REG)
#endif

#define IN0 ((IO_IN_TypeDef *)GPIO_IN_REG)
#ifdef GPIO_IN1_REG
#define IN1 ((IO_IN_TypeDef *)GPIO_IN1_REG)
#endif

#define __io_mux(pin) (IO_MUX_##pin##_REG)
#define __io_mux__(pin) __io_mux(pin)
#define __io_out_conf(pin) (GPIO_FUNC##pin##_OUT_SEL_CFG_REG)
#define __io_out_conf__(pin) (IO_MUX_##pin##_REG)
#define __io_in_conf(pin) (GPIO_FUNC##pin##_IN_SEL_CFG_REG)
#define __io_in_conf__(pin) (IO_MUX_##pin##_REG)
#define __io_en(pin) (GPIO_FUNC##pin##_IN_SEL_CFG_REG)
#define __io_en__(pin) (IO_MUX_##pin##_REG)

// IO pins
#if (defined(STEP0_BIT))
#define STEP0 1
#if (STEP0_BIT < 32)
#define STEP0_MUXREG __io_mux__(STEP0_BIT)
#define STEP0_OUT_CONFREG __io_out_conf__(STEP0_BIT)
#define STEP0_IN_CONFREG __io_in_conf__(STEP0_BIT)
#define STEP0_OUTREG OUT0
#define STEP0_INREG IN0
#else
#define STEP0_OUTREG OUT1
#define STEP0_INREG IN1
#endif
#define DIO1 1
#define DIO1_BIT STEP0_BIT
#define DIO1_MUXREG STEP0_MUXREG
#define DIO1_OUT_CONFREG STEP0_OUT_CONFREG
#define DIO1_IN_CONFREG STEP0_IN_CONFREG
#define DIO1_OUTREG STEP0_OUTREG
#define DIO1_INREG STEP0_INREG
#endif
#if (defined(STEP1_BIT))
#define STEP1 2
#if (STEP1_BIT < 32)
#define STEP1_MUXREG __io_mux__(STEP1_BIT)
#define STEP1_OUT_CONFREG __io_out_conf__(STEP1_BIT)
#define STEP1_IN_CONFREG __io_in_conf__(STEP1_BIT)
#define STEP1_OUTREG OUT0
#define STEP1_INREG IN0
#else
#define STEP1_OUTREG OUT1
#define STEP1_INREG IN1
#endif
#define DIO2 2
#define DIO2_BIT STEP1_BIT
#define DIO2_MUXREG STEP1_MUXREG
#define DIO2_OUT_CONFREG STEP1_OUT_CONFREG
#define DIO2_IN_CONFREG STEP1_IN_CONFREG
#define DIO2_OUTREG STEP1_OUTREG
#define DIO2_INREG STEP1_INREG
#endif
#if (defined(STEP2_BIT))
#define STEP2 3
#if (STEP2_BIT < 32)
#define STEP2_MUXREG __io_mux__(STEP2_BIT)
#define STEP2_OUT_CONFREG __io_out_conf__(STEP2_BIT)
#define STEP2_IN_CONFREG __io_in_conf__(STEP2_BIT)
#define STEP2_OUTREG OUT0
#define STEP2_INREG IN0
#else
#define STEP2_OUTREG OUT1
#define STEP2_INREG IN1
#endif
#define DIO3 3
#define DIO3_BIT STEP2_BIT
#define DIO3_MUXREG STEP2_MUXREG
#define DIO3_OUT_CONFREG STEP2_OUT_CONFREG
#define DIO3_IN_CONFREG STEP2_IN_CONFREG
#define DIO3_OUTREG STEP2_OUTREG
#define DIO3_INREG STEP2_INREG
#endif
#if (defined(STEP3_BIT))
#define STEP3 4
#if (STEP3_BIT < 32)
#define STEP3_MUXREG __io_mux__(STEP3_BIT)
#define STEP3_OUT_CONFREG __io_out_conf__(STEP3_BIT)
#define STEP3_IN_CONFREG __io_in_conf__(STEP3_BIT)
#define STEP3_OUTREG OUT0
#define STEP3_INREG IN0
#else
#define STEP3_OUTREG OUT1
#define STEP3_INREG IN1
#endif
#define DIO4 4
#define DIO4_BIT STEP3_BIT
#define DIO4_MUXREG STEP3_MUXREG
#define DIO4_OUT_CONFREG STEP3_OUT_CONFREG
#define DIO4_IN_CONFREG STEP3_IN_CONFREG
#define DIO4_OUTREG STEP3_OUTREG
#define DIO4_INREG STEP3_INREG
#endif
#if (defined(STEP4_BIT))
#define STEP4 5
#if (STEP4_BIT < 32)
#define STEP4_MUXREG __io_mux__(STEP4_BIT)
#define STEP4_OUT_CONFREG __io_out_conf__(STEP4_BIT)
#define STEP4_IN_CONFREG __io_in_conf__(STEP4_BIT)
#define STEP4_OUTREG OUT0
#define STEP4_INREG IN0
#else
#define STEP4_OUTREG OUT1
#define STEP4_INREG IN1
#endif
#define DIO5 5
#define DIO5_BIT STEP4_BIT
#define DIO5_MUXREG STEP4_MUXREG
#define DIO5_OUT_CONFREG STEP4_OUT_CONFREG
#define DIO5_IN_CONFREG STEP4_IN_CONFREG
#define DIO5_OUTREG STEP4_OUTREG
#define DIO5_INREG STEP4_INREG
#endif
#if (defined(STEP5_BIT))
#define STEP5 6
#if (STEP5_BIT < 32)
#define STEP5_MUXREG __io_mux__(STEP5_BIT)
#define STEP5_OUT_CONFREG __io_out_conf__(STEP5_BIT)
#define STEP5_IN_CONFREG __io_in_conf__(STEP5_BIT)
#define STEP5_OUTREG OUT0
#define STEP5_INREG IN0
#else
#define STEP5_OUTREG OUT1
#define STEP5_INREG IN1
#endif
#define DIO6 6
#define DIO6_BIT STEP5_BIT
#define DIO6_MUXREG STEP5_MUXREG
#define DIO6_OUT_CONFREG STEP5_OUT_CONFREG
#define DIO6_IN_CONFREG STEP5_IN_CONFREG
#define DIO6_OUTREG STEP5_OUTREG
#define DIO6_INREG STEP5_INREG
#endif
#if (defined(STEP6_BIT))
#define STEP6 7
#if (STEP6_BIT < 32)
#define STEP6_MUXREG __io_mux__(STEP6_BIT)
#define STEP6_OUT_CONFREG __io_out_conf__(STEP6_BIT)
#define STEP6_IN_CONFREG __io_in_conf__(STEP6_BIT)
#define STEP6_OUTREG OUT0
#define STEP6_INREG IN0
#else
#define STEP6_OUTREG OUT1
#define STEP6_INREG IN1
#endif
#define DIO7 7
#define DIO7_BIT STEP6_BIT
#define DIO7_MUXREG STEP6_MUXREG
#define DIO7_OUT_CONFREG STEP6_OUT_CONFREG
#define DIO7_IN_CONFREG STEP6_IN_CONFREG
#define DIO7_OUTREG STEP6_OUTREG
#define DIO7_INREG STEP6_INREG
#endif
#if (defined(STEP7_BIT))
#define STEP7 8
#if (STEP7_BIT < 32)
#define STEP7_MUXREG __io_mux__(STEP7_BIT)
#define STEP7_OUT_CONFREG __io_out_conf__(STEP7_BIT)
#define STEP7_IN_CONFREG __io_in_conf__(STEP7_BIT)
#define STEP7_OUTREG OUT0
#define STEP7_INREG IN0
#else
#define STEP7_OUTREG OUT1
#define STEP7_INREG IN1
#endif
#define DIO8 8
#define DIO8_BIT STEP7_BIT
#define DIO8_MUXREG STEP7_MUXREG
#define DIO8_OUT_CONFREG STEP7_OUT_CONFREG
#define DIO8_IN_CONFREG STEP7_IN_CONFREG
#define DIO8_OUTREG STEP7_OUTREG
#define DIO8_INREG STEP7_INREG
#endif
#if (defined(DIR0_BIT))
#define DIR0 9
#if (DIR0_BIT < 32)
#define DIR0_MUXREG __io_mux__(DIR0_BIT)
#define DIR0_OUT_CONFREG __io_out_conf__(DIR0_BIT)
#define DIR0_IN_CONFREG __io_in_conf__(DIR0_BIT)
#define DIR0_OUTREG OUT0
#define DIR0_INREG IN0
#else
#define DIR0_OUTREG OUT1
#define DIR0_INREG IN1
#endif
#define DIO9 9
#define DIO9_BIT DIR0_BIT
#define DIO9_MUXREG DIR0_MUXREG
#define DIO9_OUT_CONFREG DIR0_OUT_CONFREG
#define DIO9_IN_CONFREG DIR0_IN_CONFREG
#define DIO9_OUTREG DIR0_OUTREG
#define DIO9_INREG DIR0_INREG
#endif
#if (defined(DIR1_BIT))
#define DIR1 10
#if (DIR1_BIT < 32)
#define DIR1_MUXREG __io_mux__(DIR1_BIT)
#define DIR1_OUT_CONFREG __io_out_conf__(DIR1_BIT)
#define DIR1_IN_CONFREG __io_in_conf__(DIR1_BIT)
#define DIR1_OUTREG OUT0
#define DIR1_INREG IN0
#else
#define DIR1_OUTREG OUT1
#define DIR1_INREG IN1
#endif
#define DIO10 10
#define DIO10_BIT DIR1_BIT
#define DIO10_MUXREG DIR1_MUXREG
#define DIO10_OUT_CONFREG DIR1_OUT_CONFREG
#define DIO10_IN_CONFREG DIR1_IN_CONFREG
#define DIO10_OUTREG DIR1_OUTREG
#define DIO10_INREG DIR1_INREG
#endif
#if (defined(DIR2_BIT))
#define DIR2 11
#if (DIR2_BIT < 32)
#define DIR2_MUXREG __io_mux__(DIR2_BIT)
#define DIR2_OUT_CONFREG __io_out_conf__(DIR2_BIT)
#define DIR2_IN_CONFREG __io_in_conf__(DIR2_BIT)
#define DIR2_OUTREG OUT0
#define DIR2_INREG IN0
#else
#define DIR2_OUTREG OUT1
#define DIR2_INREG IN1
#endif
#define DIO11 11
#define DIO11_BIT DIR2_BIT
#define DIO11_MUXREG DIR2_MUXREG
#define DIO11_OUT_CONFREG DIR2_OUT_CONFREG
#define DIO11_IN_CONFREG DIR2_IN_CONFREG
#define DIO11_OUTREG DIR2_OUTREG
#define DIO11_INREG DIR2_INREG
#endif
#if (defined(DIR3_BIT))
#define DIR3 12
#if (DIR3_BIT < 32)
#define DIR3_MUXREG __io_mux__(DIR3_BIT)
#define DIR3_OUT_CONFREG __io_out_conf__(DIR3_BIT)
#define DIR3_IN_CONFREG __io_in_conf__(DIR3_BIT)
#define DIR3_OUTREG OUT0
#define DIR3_INREG IN0
#else
#define DIR3_OUTREG OUT1
#define DIR3_INREG IN1
#endif
#define DIO12 12
#define DIO12_BIT DIR3_BIT
#define DIO12_MUXREG DIR3_MUXREG
#define DIO12_OUT_CONFREG DIR3_OUT_CONFREG
#define DIO12_IN_CONFREG DIR3_IN_CONFREG
#define DIO12_OUTREG DIR3_OUTREG
#define DIO12_INREG DIR3_INREG
#endif
#if (defined(DIR4_BIT))
#define DIR4 13
#if (DIR4_BIT < 32)
#define DIR4_MUXREG __io_mux__(DIR4_BIT)
#define DIR4_OUT_CONFREG __io_out_conf__(DIR4_BIT)
#define DIR4_IN_CONFREG __io_in_conf__(DIR4_BIT)
#define DIR4_OUTREG OUT0
#define DIR4_INREG IN0
#else
#define DIR4_OUTREG OUT1
#define DIR4_INREG IN1
#endif
#define DIO13 13
#define DIO13_BIT DIR4_BIT
#define DIO13_MUXREG DIR4_MUXREG
#define DIO13_OUT_CONFREG DIR4_OUT_CONFREG
#define DIO13_IN_CONFREG DIR4_IN_CONFREG
#define DIO13_OUTREG DIR4_OUTREG
#define DIO13_INREG DIR4_INREG
#endif
#if (defined(DIR5_BIT))
#define DIR5 14
#if (DIR5_BIT < 32)
#define DIR5_MUXREG __io_mux__(DIR5_BIT)
#define DIR5_OUT_CONFREG __io_out_conf__(DIR5_BIT)
#define DIR5_IN_CONFREG __io_in_conf__(DIR5_BIT)
#define DIR5_OUTREG OUT0
#define DIR5_INREG IN0
#else
#define DIR5_OUTREG OUT1
#define DIR5_INREG IN1
#endif
#define DIO14 14
#define DIO14_BIT DIR5_BIT
#define DIO14_MUXREG DIR5_MUXREG
#define DIO14_OUT_CONFREG DIR5_OUT_CONFREG
#define DIO14_IN_CONFREG DIR5_IN_CONFREG
#define DIO14_OUTREG DIR5_OUTREG
#define DIO14_INREG DIR5_INREG
#endif
#if (defined(DIR6_BIT))
#define DIR6 15
#if (DIR6_BIT < 32)
#define DIR6_MUXREG __io_mux__(DIR6_BIT)
#define DIR6_OUT_CONFREG __io_out_conf__(DIR6_BIT)
#define DIR6_IN_CONFREG __io_in_conf__(DIR6_BIT)
#define DIR6_OUTREG OUT0
#define DIR6_INREG IN0
#else
#define DIR6_OUTREG OUT1
#define DIR6_INREG IN1
#endif
#define DIO15 15
#define DIO15_BIT DIR6_BIT
#define DIO15_MUXREG DIR6_MUXREG
#define DIO15_OUT_CONFREG DIR6_OUT_CONFREG
#define DIO15_IN_CONFREG DIR6_IN_CONFREG
#define DIO15_OUTREG DIR6_OUTREG
#define DIO15_INREG DIR6_INREG
#endif
#if (defined(DIR7_BIT))
#define DIR7 16
#if (DIR7_BIT < 32)
#define DIR7_MUXREG __io_mux__(DIR7_BIT)
#define DIR7_OUT_CONFREG __io_out_conf__(DIR7_BIT)
#define DIR7_IN_CONFREG __io_in_conf__(DIR7_BIT)
#define DIR7_OUTREG OUT0
#define DIR7_INREG IN0
#else
#define DIR7_OUTREG OUT1
#define DIR7_INREG IN1
#endif
#define DIO16 16
#define DIO16_BIT DIR7_BIT
#define DIO16_MUXREG DIR7_MUXREG
#define DIO16_OUT_CONFREG DIR7_OUT_CONFREG
#define DIO16_IN_CONFREG DIR7_IN_CONFREG
#define DIO16_OUTREG DIR7_OUTREG
#define DIO16_INREG DIR7_INREG
#endif
#if (defined(STEP0_EN_BIT))
#define STEP0_EN 17
#if (STEP0_EN_BIT < 32)
#define STEP0_EN_MUXREG __io_mux__(STEP0_EN_BIT)
#define STEP0_EN_OUT_CONFREG __io_out_conf__(STEP0_EN_BIT)
#define STEP0_EN_IN_CONFREG __io_in_conf__(STEP0_EN_BIT)
#define STEP0_EN_OUTREG OUT0
#define STEP0_EN_INREG IN0
#else
#define STEP0_EN_OUTREG OUT1
#define STEP0_EN_INREG IN1
#endif
#define DIO17 17
#define DIO17_BIT STEP0_EN_BIT
#define DIO17_MUXREG STEP0_EN_MUXREG
#define DIO17_OUT_CONFREG STEP0_EN_OUT_CONFREG
#define DIO17_IN_CONFREG STEP0_EN_IN_CONFREG
#define DIO17_OUTREG STEP0_EN_OUTREG
#define DIO17_INREG STEP0_EN_INREG
#endif
#if (defined(STEP1_EN_BIT))
#define STEP1_EN 18
#if (STEP1_EN_BIT < 32)
#define STEP1_EN_MUXREG __io_mux__(STEP1_EN_BIT)
#define STEP1_EN_OUT_CONFREG __io_out_conf__(STEP1_EN_BIT)
#define STEP1_EN_IN_CONFREG __io_in_conf__(STEP1_EN_BIT)
#define STEP1_EN_OUTREG OUT0
#define STEP1_EN_INREG IN0
#else
#define STEP1_EN_OUTREG OUT1
#define STEP1_EN_INREG IN1
#endif
#define DIO18 18
#define DIO18_BIT STEP1_EN_BIT
#define DIO18_MUXREG STEP1_EN_MUXREG
#define DIO18_OUT_CONFREG STEP1_EN_OUT_CONFREG
#define DIO18_IN_CONFREG STEP1_EN_IN_CONFREG
#define DIO18_OUTREG STEP1_EN_OUTREG
#define DIO18_INREG STEP1_EN_INREG
#endif
#if (defined(STEP2_EN_BIT))
#define STEP2_EN 19
#if (STEP2_EN_BIT < 32)
#define STEP2_EN_MUXREG __io_mux__(STEP2_EN_BIT)
#define STEP2_EN_OUT_CONFREG __io_out_conf__(STEP2_EN_BIT)
#define STEP2_EN_IN_CONFREG __io_in_conf__(STEP2_EN_BIT)
#define STEP2_EN_OUTREG OUT0
#define STEP2_EN_INREG IN0
#else
#define STEP2_EN_OUTREG OUT1
#define STEP2_EN_INREG IN1
#endif
#define DIO19 19
#define DIO19_BIT STEP2_EN_BIT
#define DIO19_MUXREG STEP2_EN_MUXREG
#define DIO19_OUT_CONFREG STEP2_EN_OUT_CONFREG
#define DIO19_IN_CONFREG STEP2_EN_IN_CONFREG
#define DIO19_OUTREG STEP2_EN_OUTREG
#define DIO19_INREG STEP2_EN_INREG
#endif
#if (defined(STEP3_EN_BIT))
#define STEP3_EN 20
#if (STEP3_EN_BIT < 32)
#define STEP3_EN_MUXREG __io_mux__(STEP3_EN_BIT)
#define STEP3_EN_OUT_CONFREG __io_out_conf__(STEP3_EN_BIT)
#define STEP3_EN_IN_CONFREG __io_in_conf__(STEP3_EN_BIT)
#define STEP3_EN_OUTREG OUT0
#define STEP3_EN_INREG IN0
#else
#define STEP3_EN_OUTREG OUT1
#define STEP3_EN_INREG IN1
#endif
#define DIO20 20
#define DIO20_BIT STEP3_EN_BIT
#define DIO20_MUXREG STEP3_EN_MUXREG
#define DIO20_OUT_CONFREG STEP3_EN_OUT_CONFREG
#define DIO20_IN_CONFREG STEP3_EN_IN_CONFREG
#define DIO20_OUTREG STEP3_EN_OUTREG
#define DIO20_INREG STEP3_EN_INREG
#endif
#if (defined(STEP4_EN_BIT))
#define STEP4_EN 21
#if (STEP4_EN_BIT < 32)
#define STEP4_EN_MUXREG __io_mux__(STEP4_EN_BIT)
#define STEP4_EN_OUT_CONFREG __io_out_conf__(STEP4_EN_BIT)
#define STEP4_EN_IN_CONFREG __io_in_conf__(STEP4_EN_BIT)
#define STEP4_EN_OUTREG OUT0
#define STEP4_EN_INREG IN0
#else
#define STEP4_EN_OUTREG OUT1
#define STEP4_EN_INREG IN1
#endif
#define DIO21 21
#define DIO21_BIT STEP4_EN_BIT
#define DIO21_MUXREG STEP4_EN_MUXREG
#define DIO21_OUT_CONFREG STEP4_EN_OUT_CONFREG
#define DIO21_IN_CONFREG STEP4_EN_IN_CONFREG
#define DIO21_OUTREG STEP4_EN_OUTREG
#define DIO21_INREG STEP4_EN_INREG
#endif
#if (defined(STEP5_EN_BIT))
#define STEP5_EN 22
#if (STEP5_EN_BIT < 32)
#define STEP5_EN_MUXREG __io_mux__(STEP5_EN_BIT)
#define STEP5_EN_OUT_CONFREG __io_out_conf__(STEP5_EN_BIT)
#define STEP5_EN_IN_CONFREG __io_in_conf__(STEP5_EN_BIT)
#define STEP5_EN_OUTREG OUT0
#define STEP5_EN_INREG IN0
#else
#define STEP5_EN_OUTREG OUT1
#define STEP5_EN_INREG IN1
#endif
#define DIO22 22
#define DIO22_BIT STEP5_EN_BIT
#define DIO22_MUXREG STEP5_EN_MUXREG
#define DIO22_OUT_CONFREG STEP5_EN_OUT_CONFREG
#define DIO22_IN_CONFREG STEP5_EN_IN_CONFREG
#define DIO22_OUTREG STEP5_EN_OUTREG
#define DIO22_INREG STEP5_EN_INREG
#endif
#if (defined(STEP6_EN_BIT))
#define STEP6_EN 23
#if (STEP6_EN_BIT < 32)
#define STEP6_EN_MUXREG __io_mux__(STEP6_EN_BIT)
#define STEP6_EN_OUT_CONFREG __io_out_conf__(STEP6_EN_BIT)
#define STEP6_EN_IN_CONFREG __io_in_conf__(STEP6_EN_BIT)
#define STEP6_EN_OUTREG OUT0
#define STEP6_EN_INREG IN0
#else
#define STEP6_EN_OUTREG OUT1
#define STEP6_EN_INREG IN1
#endif
#define DIO23 23
#define DIO23_BIT STEP6_EN_BIT
#define DIO23_MUXREG STEP6_EN_MUXREG
#define DIO23_OUT_CONFREG STEP6_EN_OUT_CONFREG
#define DIO23_IN_CONFREG STEP6_EN_IN_CONFREG
#define DIO23_OUTREG STEP6_EN_OUTREG
#define DIO23_INREG STEP6_EN_INREG
#endif
#if (defined(STEP7_EN_BIT))
#define STEP7_EN 24
#if (STEP7_EN_BIT < 32)
#define STEP7_EN_MUXREG __io_mux__(STEP7_EN_BIT)
#define STEP7_EN_OUT_CONFREG __io_out_conf__(STEP7_EN_BIT)
#define STEP7_EN_IN_CONFREG __io_in_conf__(STEP7_EN_BIT)
#define STEP7_EN_OUTREG OUT0
#define STEP7_EN_INREG IN0
#else
#define STEP7_EN_OUTREG OUT1
#define STEP7_EN_INREG IN1
#endif
#define DIO24 24
#define DIO24_BIT STEP7_EN_BIT
#define DIO24_MUXREG STEP7_EN_MUXREG
#define DIO24_OUT_CONFREG STEP7_EN_OUT_CONFREG
#define DIO24_IN_CONFREG STEP7_EN_IN_CONFREG
#define DIO24_OUTREG STEP7_EN_OUTREG
#define DIO24_INREG STEP7_EN_INREG
#endif
#if (defined(PWM0_BIT))
#define PWM0 25
#if (PWM0_BIT < 32)
#define PWM0_MUXREG __io_mux__(PWM0_BIT)
#define PWM0_OUT_CONFREG __io_out_conf__(PWM0_BIT)
#define PWM0_IN_CONFREG __io_in_conf__(PWM0_BIT)
#define PWM0_OUTREG OUT0
#define PWM0_INREG IN0
#else
#define PWM0_OUTREG OUT1
#define PWM0_INREG IN1
#endif
#define DIO25 25
#define DIO25_BIT PWM0_BIT
#define DIO25_MUXREG PWM0_MUXREG
#define DIO25_OUT_CONFREG PWM0_OUT_CONFREG
#define DIO25_IN_CONFREG PWM0_IN_CONFREG
#define DIO25_OUTREG PWM0_OUTREG
#define DIO25_INREG PWM0_INREG
#endif
#if (defined(PWM1_BIT))
#define PWM1 26
#if (PWM1_BIT < 32)
#define PWM1_MUXREG __io_mux__(PWM1_BIT)
#define PWM1_OUT_CONFREG __io_out_conf__(PWM1_BIT)
#define PWM1_IN_CONFREG __io_in_conf__(PWM1_BIT)
#define PWM1_OUTREG OUT0
#define PWM1_INREG IN0
#else
#define PWM1_OUTREG OUT1
#define PWM1_INREG IN1
#endif
#define DIO26 26
#define DIO26_BIT PWM1_BIT
#define DIO26_MUXREG PWM1_MUXREG
#define DIO26_OUT_CONFREG PWM1_OUT_CONFREG
#define DIO26_IN_CONFREG PWM1_IN_CONFREG
#define DIO26_OUTREG PWM1_OUTREG
#define DIO26_INREG PWM1_INREG
#endif
#if (defined(PWM2_BIT))
#define PWM2 27
#if (PWM2_BIT < 32)
#define PWM2_MUXREG __io_mux__(PWM2_BIT)
#define PWM2_OUT_CONFREG __io_out_conf__(PWM2_BIT)
#define PWM2_IN_CONFREG __io_in_conf__(PWM2_BIT)
#define PWM2_OUTREG OUT0
#define PWM2_INREG IN0
#else
#define PWM2_OUTREG OUT1
#define PWM2_INREG IN1
#endif
#define DIO27 27
#define DIO27_BIT PWM2_BIT
#define DIO27_MUXREG PWM2_MUXREG
#define DIO27_OUT_CONFREG PWM2_OUT_CONFREG
#define DIO27_IN_CONFREG PWM2_IN_CONFREG
#define DIO27_OUTREG PWM2_OUTREG
#define DIO27_INREG PWM2_INREG
#endif
#if (defined(PWM3_BIT))
#define PWM3 28
#if (PWM3_BIT < 32)
#define PWM3_MUXREG __io_mux__(PWM3_BIT)
#define PWM3_OUT_CONFREG __io_out_conf__(PWM3_BIT)
#define PWM3_IN_CONFREG __io_in_conf__(PWM3_BIT)
#define PWM3_OUTREG OUT0
#define PWM3_INREG IN0
#else
#define PWM3_OUTREG OUT1
#define PWM3_INREG IN1
#endif
#define DIO28 28
#define DIO28_BIT PWM3_BIT
#define DIO28_MUXREG PWM3_MUXREG
#define DIO28_OUT_CONFREG PWM3_OUT_CONFREG
#define DIO28_IN_CONFREG PWM3_IN_CONFREG
#define DIO28_OUTREG PWM3_OUTREG
#define DIO28_INREG PWM3_INREG
#endif
#if (defined(PWM4_BIT))
#define PWM4 29
#if (PWM4_BIT < 32)
#define PWM4_MUXREG __io_mux__(PWM4_BIT)
#define PWM4_OUT_CONFREG __io_out_conf__(PWM4_BIT)
#define PWM4_IN_CONFREG __io_in_conf__(PWM4_BIT)
#define PWM4_OUTREG OUT0
#define PWM4_INREG IN0
#else
#define PWM4_OUTREG OUT1
#define PWM4_INREG IN1
#endif
#define DIO29 29
#define DIO29_BIT PWM4_BIT
#define DIO29_MUXREG PWM4_MUXREG
#define DIO29_OUT_CONFREG PWM4_OUT_CONFREG
#define DIO29_IN_CONFREG PWM4_IN_CONFREG
#define DIO29_OUTREG PWM4_OUTREG
#define DIO29_INREG PWM4_INREG
#endif
#if (defined(PWM5_BIT))
#define PWM5 30
#if (PWM5_BIT < 32)
#define PWM5_MUXREG __io_mux__(PWM5_BIT)
#define PWM5_OUT_CONFREG __io_out_conf__(PWM5_BIT)
#define PWM5_IN_CONFREG __io_in_conf__(PWM5_BIT)
#define PWM5_OUTREG OUT0
#define PWM5_INREG IN0
#else
#define PWM5_OUTREG OUT1
#define PWM5_INREG IN1
#endif
#define DIO30 30
#define DIO30_BIT PWM5_BIT
#define DIO30_MUXREG PWM5_MUXREG
#define DIO30_OUT_CONFREG PWM5_OUT_CONFREG
#define DIO30_IN_CONFREG PWM5_IN_CONFREG
#define DIO30_OUTREG PWM5_OUTREG
#define DIO30_INREG PWM5_INREG
#endif
#if (defined(PWM6_BIT))
#define PWM6 31
#if (PWM6_BIT < 32)
#define PWM6_MUXREG __io_mux__(PWM6_BIT)
#define PWM6_OUT_CONFREG __io_out_conf__(PWM6_BIT)
#define PWM6_IN_CONFREG __io_in_conf__(PWM6_BIT)
#define PWM6_OUTREG OUT0
#define PWM6_INREG IN0
#else
#define PWM6_OUTREG OUT1
#define PWM6_INREG IN1
#endif
#define DIO31 31
#define DIO31_BIT PWM6_BIT
#define DIO31_MUXREG PWM6_MUXREG
#define DIO31_OUT_CONFREG PWM6_OUT_CONFREG
#define DIO31_IN_CONFREG PWM6_IN_CONFREG
#define DIO31_OUTREG PWM6_OUTREG
#define DIO31_INREG PWM6_INREG
#endif
#if (defined(PWM7_BIT))
#define PWM7 32
#if (PWM7_BIT < 32)
#define PWM7_MUXREG __io_mux__(PWM7_BIT)
#define PWM7_OUT_CONFREG __io_out_conf__(PWM7_BIT)
#define PWM7_IN_CONFREG __io_in_conf__(PWM7_BIT)
#define PWM7_OUTREG OUT0
#define PWM7_INREG IN0
#else
#define PWM7_OUTREG OUT1
#define PWM7_INREG IN1
#endif
#define DIO32 32
#define DIO32_BIT PWM7_BIT
#define DIO32_MUXREG PWM7_MUXREG
#define DIO32_OUT_CONFREG PWM7_OUT_CONFREG
#define DIO32_IN_CONFREG PWM7_IN_CONFREG
#define DIO32_OUTREG PWM7_OUTREG
#define DIO32_INREG PWM7_INREG
#endif
#if (defined(PWM8_BIT))
#define PWM8 33
#if (PWM8_BIT < 32)
#define PWM8_MUXREG __io_mux__(PWM8_BIT)
#define PWM8_OUT_CONFREG __io_out_conf__(PWM8_BIT)
#define PWM8_IN_CONFREG __io_in_conf__(PWM8_BIT)
#define PWM8_OUTREG OUT0
#define PWM8_INREG IN0
#else
#define PWM8_OUTREG OUT1
#define PWM8_INREG IN1
#endif
#define DIO33 33
#define DIO33_BIT PWM8_BIT
#define DIO33_MUXREG PWM8_MUXREG
#define DIO33_OUT_CONFREG PWM8_OUT_CONFREG
#define DIO33_IN_CONFREG PWM8_IN_CONFREG
#define DIO33_OUTREG PWM8_OUTREG
#define DIO33_INREG PWM8_INREG
#endif
#if (defined(PWM9_BIT))
#define PWM9 34
#if (PWM9_BIT < 32)
#define PWM9_MUXREG __io_mux__(PWM9_BIT)
#define PWM9_OUT_CONFREG __io_out_conf__(PWM9_BIT)
#define PWM9_IN_CONFREG __io_in_conf__(PWM9_BIT)
#define PWM9_OUTREG OUT0
#define PWM9_INREG IN0
#else
#define PWM9_OUTREG OUT1
#define PWM9_INREG IN1
#endif
#define DIO34 34
#define DIO34_BIT PWM9_BIT
#define DIO34_MUXREG PWM9_MUXREG
#define DIO34_OUT_CONFREG PWM9_OUT_CONFREG
#define DIO34_IN_CONFREG PWM9_IN_CONFREG
#define DIO34_OUTREG PWM9_OUTREG
#define DIO34_INREG PWM9_INREG
#endif
#if (defined(PWM10_BIT))
#define PWM10 35
#if (PWM10_BIT < 32)
#define PWM10_MUXREG __io_mux__(PWM10_BIT)
#define PWM10_OUT_CONFREG __io_out_conf__(PWM10_BIT)
#define PWM10_IN_CONFREG __io_in_conf__(PWM10_BIT)
#define PWM10_OUTREG OUT0
#define PWM10_INREG IN0
#else
#define PWM10_OUTREG OUT1
#define PWM10_INREG IN1
#endif
#define DIO35 35
#define DIO35_BIT PWM10_BIT
#define DIO35_MUXREG PWM10_MUXREG
#define DIO35_OUT_CONFREG PWM10_OUT_CONFREG
#define DIO35_IN_CONFREG PWM10_IN_CONFREG
