Paciente8159/uCNC/uCNC/src/hal/mcus/esp32s/mcumap_esp32s.h
#define DIO35_OUTREG PWM10_OUTREG
#define DIO35_INREG PWM10_INREG
#endif
#if (defined(PWM11_BIT))
#define PWM11 36
#if (PWM11_BIT < 32)
#define PWM11_MUXREG __io_mux__(PWM11_BIT)
#define PWM11_OUT_CONFREG __io_out_conf__(PWM11_BIT)
#define PWM11_IN_CONFREG __io_in_conf__(PWM11_BIT)
#define PWM11_OUTREG OUT0
#define PWM11_INREG IN0
#else
#define PWM11_OUTREG OUT1
#define PWM11_INREG IN1
#endif
#define DIO36 36
#define DIO36_BIT PWM11_BIT
#define DIO36_MUXREG PWM11_MUXREG
#define DIO36_OUT_CONFREG PWM11_OUT_CONFREG
#define DIO36_IN_CONFREG PWM11_IN_CONFREG
#define DIO36_OUTREG PWM11_OUTREG
#define DIO36_INREG PWM11_INREG
#endif
#if (defined(PWM12_BIT))
#define PWM12 37
#if (PWM12_BIT < 32)
#define PWM12_MUXREG __io_mux__(PWM12_BIT)
#define PWM12_OUT_CONFREG __io_out_conf__(PWM12_BIT)
#define PWM12_IN_CONFREG __io_in_conf__(PWM12_BIT)
#define PWM12_OUTREG OUT0
#define PWM12_INREG IN0
#else
#define PWM12_OUTREG OUT1
#define PWM12_INREG IN1
#endif
#define DIO37 37
#define DIO37_BIT PWM12_BIT
#define DIO37_MUXREG PWM12_MUXREG
#define DIO37_OUT_CONFREG PWM12_OUT_CONFREG
#define DIO37_IN_CONFREG PWM12_IN_CONFREG
#define DIO37_OUTREG PWM12_OUTREG
#define DIO37_INREG PWM12_INREG
#endif
#if (defined(PWM13_BIT))
#define PWM13 38
#if (PWM13_BIT < 32)
#define PWM13_MUXREG __io_mux__(PWM13_BIT)
#define PWM13_OUT_CONFREG __io_out_conf__(PWM13_BIT)
#define PWM13_IN_CONFREG __io_in_conf__(PWM13_BIT)
#define PWM13_OUTREG OUT0
#define PWM13_INREG IN0
#else
#define PWM13_OUTREG OUT1
#define PWM13_INREG IN1
#endif
#define DIO38 38
#define DIO38_BIT PWM13_BIT
#define DIO38_MUXREG PWM13_MUXREG
#define DIO38_OUT_CONFREG PWM13_OUT_CONFREG
#define DIO38_IN_CONFREG PWM13_IN_CONFREG
#define DIO38_OUTREG PWM13_OUTREG
#define DIO38_INREG PWM13_INREG
#endif
#if (defined(PWM14_BIT))
#define PWM14 39
#if (PWM14_BIT < 32)
#define PWM14_MUXREG __io_mux__(PWM14_BIT)
#define PWM14_OUT_CONFREG __io_out_conf__(PWM14_BIT)
#define PWM14_IN_CONFREG __io_in_conf__(PWM14_BIT)
#define PWM14_OUTREG OUT0
#define PWM14_INREG IN0
#else
#define PWM14_OUTREG OUT1
#define PWM14_INREG IN1
#endif
#define DIO39 39
#define DIO39_BIT PWM14_BIT
#define DIO39_MUXREG PWM14_MUXREG
#define DIO39_OUT_CONFREG PWM14_OUT_CONFREG
#define DIO39_IN_CONFREG PWM14_IN_CONFREG
#define DIO39_OUTREG PWM14_OUTREG
#define DIO39_INREG PWM14_INREG
#endif
#if (defined(PWM15_BIT))
#define PWM15 40
#if (PWM15_BIT < 32)
#define PWM15_MUXREG __io_mux__(PWM15_BIT)
#define PWM15_OUT_CONFREG __io_out_conf__(PWM15_BIT)
#define PWM15_IN_CONFREG __io_in_conf__(PWM15_BIT)
#define PWM15_OUTREG OUT0
#define PWM15_INREG IN0
#else
#define PWM15_OUTREG OUT1
#define PWM15_INREG IN1
#endif
#define DIO40 40
#define DIO40_BIT PWM15_BIT
#define DIO40_MUXREG PWM15_MUXREG
#define DIO40_OUT_CONFREG PWM15_OUT_CONFREG
#define DIO40_IN_CONFREG PWM15_IN_CONFREG
#define DIO40_OUTREG PWM15_OUTREG
#define DIO40_INREG PWM15_INREG
#endif
#if (defined(SERVO0_BIT))
#define SERVO0 41
#if (SERVO0_BIT < 32)
#define SERVO0_MUXREG __io_mux__(SERVO0_BIT)
#define SERVO0_OUT_CONFREG __io_out_conf__(SERVO0_BIT)
#define SERVO0_IN_CONFREG __io_in_conf__(SERVO0_BIT)
#define SERVO0_OUTREG OUT0
#define SERVO0_INREG IN0
#else
#define SERVO0_OUTREG OUT1
#define SERVO0_INREG IN1
#endif
#define DIO41 41
#define DIO41_BIT SERVO0_BIT
#define DIO41_MUXREG SERVO0_MUXREG
#define DIO41_OUT_CONFREG SERVO0_OUT_CONFREG
#define DIO41_IN_CONFREG SERVO0_IN_CONFREG
#define DIO41_OUTREG SERVO0_OUTREG
#define DIO41_INREG SERVO0_INREG
#endif
#if (defined(SERVO1_BIT))
#define SERVO1 42
#if (SERVO1_BIT < 32)
#define SERVO1_MUXREG __io_mux__(SERVO1_BIT)
#define SERVO1_OUT_CONFREG __io_out_conf__(SERVO1_BIT)
#define SERVO1_IN_CONFREG __io_in_conf__(SERVO1_BIT)
#define SERVO1_OUTREG OUT0
#define SERVO1_INREG IN0
#else
#define SERVO1_OUTREG OUT1
#define SERVO1_INREG IN1
#endif
#define DIO42 42
#define DIO42_BIT SERVO1_BIT
#define DIO42_MUXREG SERVO1_MUXREG
#define DIO42_OUT_CONFREG SERVO1_OUT_CONFREG
#define DIO42_IN_CONFREG SERVO1_IN_CONFREG
#define DIO42_OUTREG SERVO1_OUTREG
#define DIO42_INREG SERVO1_INREG
#endif
#if (defined(SERVO2_BIT))
#define SERVO2 43
#if (SERVO2_BIT < 32)
#define SERVO2_MUXREG __io_mux__(SERVO2_BIT)
#define SERVO2_OUT_CONFREG __io_out_conf__(SERVO2_BIT)
#define SERVO2_IN_CONFREG __io_in_conf__(SERVO2_BIT)
#define SERVO2_OUTREG OUT0
#define SERVO2_INREG IN0
#else
#define SERVO2_OUTREG OUT1
#define SERVO2_INREG IN1
#endif
#define DIO43 43
#define DIO43_BIT SERVO2_BIT
#define DIO43_MUXREG SERVO2_MUXREG
#define DIO43_OUT_CONFREG SERVO2_OUT_CONFREG
#define DIO43_IN_CONFREG SERVO2_IN_CONFREG
#define DIO43_OUTREG SERVO2_OUTREG
#define DIO43_INREG SERVO2_INREG
#endif
#if (defined(SERVO3_BIT))
#define SERVO3 44
#if (SERVO3_BIT < 32)
#define SERVO3_MUXREG __io_mux__(SERVO3_BIT)
#define SERVO3_OUT_CONFREG __io_out_conf__(SERVO3_BIT)
#define SERVO3_IN_CONFREG __io_in_conf__(SERVO3_BIT)
#define SERVO3_OUTREG OUT0
#define SERVO3_INREG IN0
#else
#define SERVO3_OUTREG OUT1
#define SERVO3_INREG IN1
#endif
#define DIO44 44
#define DIO44_BIT SERVO3_BIT
#define DIO44_MUXREG SERVO3_MUXREG
#define DIO44_OUT_CONFREG SERVO3_OUT_CONFREG
#define DIO44_IN_CONFREG SERVO3_IN_CONFREG
#define DIO44_OUTREG SERVO3_OUTREG
#define DIO44_INREG SERVO3_INREG
#endif
#if (defined(SERVO4_BIT))
#define SERVO4 45
#if (SERVO4_BIT < 32)
#define SERVO4_MUXREG __io_mux__(SERVO4_BIT)
#define SERVO4_OUT_CONFREG __io_out_conf__(SERVO4_BIT)
#define SERVO4_IN_CONFREG __io_in_conf__(SERVO4_BIT)
#define SERVO4_OUTREG OUT0
#define SERVO4_INREG IN0
#else
#define SERVO4_OUTREG OUT1
#define SERVO4_INREG IN1
#endif
#define DIO45 45
#define DIO45_BIT SERVO4_BIT
#define DIO45_MUXREG SERVO4_MUXREG
#define DIO45_OUT_CONFREG SERVO4_OUT_CONFREG
#define DIO45_IN_CONFREG SERVO4_IN_CONFREG
#define DIO45_OUTREG SERVO4_OUTREG
#define DIO45_INREG SERVO4_INREG
#endif
#if (defined(SERVO5_BIT))
#define SERVO5 46
#if (SERVO5_BIT < 32)
#define SERVO5_MUXREG __io_mux__(SERVO5_BIT)
#define SERVO5_OUT_CONFREG __io_out_conf__(SERVO5_BIT)
#define SERVO5_IN_CONFREG __io_in_conf__(SERVO5_BIT)
#define SERVO5_OUTREG OUT0
#define SERVO5_INREG IN0
#else
#define SERVO5_OUTREG OUT1
#define SERVO5_INREG IN1
#endif
#define DIO46 46
#define DIO46_BIT SERVO5_BIT
#define DIO46_MUXREG SERVO5_MUXREG
#define DIO46_OUT_CONFREG SERVO5_OUT_CONFREG
#define DIO46_IN_CONFREG SERVO5_IN_CONFREG
#define DIO46_OUTREG SERVO5_OUTREG
#define DIO46_INREG SERVO5_INREG
#endif
#if (defined(DOUT0_BIT))
#define DOUT0 47
#if (DOUT0_BIT < 32)
#define DOUT0_MUXREG __io_mux__(DOUT0_BIT)
#define DOUT0_OUT_CONFREG __io_out_conf__(DOUT0_BIT)
#define DOUT0_IN_CONFREG __io_in_conf__(DOUT0_BIT)
#define DOUT0_OUTREG OUT0
#define DOUT0_INREG IN0
#else
#define DOUT0_OUTREG OUT1
#define DOUT0_INREG IN1
#endif
#define DIO47 47
#define DIO47_BIT DOUT0_BIT
#define DIO47_MUXREG DOUT0_MUXREG
#define DIO47_OUT_CONFREG DOUT0_OUT_CONFREG
#define DIO47_IN_CONFREG DOUT0_IN_CONFREG
#define DIO47_OUTREG DOUT0_OUTREG
#define DIO47_INREG DOUT0_INREG
#endif
#if (defined(DOUT1_BIT))
#define DOUT1 48
#if (DOUT1_BIT < 32)
#define DOUT1_MUXREG __io_mux__(DOUT1_BIT)
#define DOUT1_OUT_CONFREG __io_out_conf__(DOUT1_BIT)
#define DOUT1_IN_CONFREG __io_in_conf__(DOUT1_BIT)
#define DOUT1_OUTREG OUT0
#define DOUT1_INREG IN0
#else
#define DOUT1_OUTREG OUT1
#define DOUT1_INREG IN1
#endif
#define DIO48 48
#define DIO48_BIT DOUT1_BIT
#define DIO48_MUXREG DOUT1_MUXREG
#define DIO48_OUT_CONFREG DOUT1_OUT_CONFREG
#define DIO48_IN_CONFREG DOUT1_IN_CONFREG
#define DIO48_OUTREG DOUT1_OUTREG
#define DIO48_INREG DOUT1_INREG
#endif
#if (defined(DOUT2_BIT))
#define DOUT2 49
#if (DOUT2_BIT < 32)
#define DOUT2_MUXREG __io_mux__(DOUT2_BIT)
#define DOUT2_OUT_CONFREG __io_out_conf__(DOUT2_BIT)
#define DOUT2_IN_CONFREG __io_in_conf__(DOUT2_BIT)
#define DOUT2_OUTREG OUT0
#define DOUT2_INREG IN0
#else
#define DOUT2_OUTREG OUT1
#define DOUT2_INREG IN1
#endif
#define DIO49 49
#define DIO49_BIT DOUT2_BIT
#define DIO49_MUXREG DOUT2_MUXREG
#define DIO49_OUT_CONFREG DOUT2_OUT_CONFREG
#define DIO49_IN_CONFREG DOUT2_IN_CONFREG
#define DIO49_OUTREG DOUT2_OUTREG
#define DIO49_INREG DOUT2_INREG
#endif
#if (defined(DOUT3_BIT))
#define DOUT3 50
#if (DOUT3_BIT < 32)
#define DOUT3_MUXREG __io_mux__(DOUT3_BIT)
#define DOUT3_OUT_CONFREG __io_out_conf__(DOUT3_BIT)
#define DOUT3_IN_CONFREG __io_in_conf__(DOUT3_BIT)
#define DOUT3_OUTREG OUT0
#define DOUT3_INREG IN0
#else
#define DOUT3_OUTREG OUT1
#define DOUT3_INREG IN1
#endif
#define DIO50 50
#define DIO50_BIT DOUT3_BIT
#define DIO50_MUXREG DOUT3_MUXREG
#define DIO50_OUT_CONFREG DOUT3_OUT_CONFREG
#define DIO50_IN_CONFREG DOUT3_IN_CONFREG
#define DIO50_OUTREG DOUT3_OUTREG
#define DIO50_INREG DOUT3_INREG
#endif
#if (defined(DOUT4_BIT))
#define DOUT4 51
#if (DOUT4_BIT < 32)
#define DOUT4_MUXREG __io_mux__(DOUT4_BIT)
#define DOUT4_OUT_CONFREG __io_out_conf__(DOUT4_BIT)
#define DOUT4_IN_CONFREG __io_in_conf__(DOUT4_BIT)
#define DOUT4_OUTREG OUT0
#define DOUT4_INREG IN0
#else
#define DOUT4_OUTREG OUT1
#define DOUT4_INREG IN1
#endif
#define DIO51 51
#define DIO51_BIT DOUT4_BIT
#define DIO51_MUXREG DOUT4_MUXREG
#define DIO51_OUT_CONFREG DOUT4_OUT_CONFREG
#define DIO51_IN_CONFREG DOUT4_IN_CONFREG
#define DIO51_OUTREG DOUT4_OUTREG
#define DIO51_INREG DOUT4_INREG
#endif
#if (defined(DOUT5_BIT))
#define DOUT5 52
#if (DOUT5_BIT < 32)
#define DOUT5_MUXREG __io_mux__(DOUT5_BIT)
#define DOUT5_OUT_CONFREG __io_out_conf__(DOUT5_BIT)
#define DOUT5_IN_CONFREG __io_in_conf__(DOUT5_BIT)
#define DOUT5_OUTREG OUT0
#define DOUT5_INREG IN0
#else
#define DOUT5_OUTREG OUT1
#define DOUT5_INREG IN1
#endif
#define DIO52 52
#define DIO52_BIT DOUT5_BIT
#define DIO52_MUXREG DOUT5_MUXREG
#define DIO52_OUT_CONFREG DOUT5_OUT_CONFREG
#define DIO52_IN_CONFREG DOUT5_IN_CONFREG
#define DIO52_OUTREG DOUT5_OUTREG
#define DIO52_INREG DOUT5_INREG
#endif
#if (defined(DOUT6_BIT))
#define DOUT6 53
#if (DOUT6_BIT < 32)
#define DOUT6_MUXREG __io_mux__(DOUT6_BIT)
#define DOUT6_OUT_CONFREG __io_out_conf__(DOUT6_BIT)
#define DOUT6_IN_CONFREG __io_in_conf__(DOUT6_BIT)
#define DOUT6_OUTREG OUT0
#define DOUT6_INREG IN0
#else
#define DOUT6_OUTREG OUT1
#define DOUT6_INREG IN1
#endif
#define DIO53 53
#define DIO53_BIT DOUT6_BIT
#define DIO53_MUXREG DOUT6_MUXREG
#define DIO53_OUT_CONFREG DOUT6_OUT_CONFREG
#define DIO53_IN_CONFREG DOUT6_IN_CONFREG
#define DIO53_OUTREG DOUT6_OUTREG
#define DIO53_INREG DOUT6_INREG
#endif
#if (defined(DOUT7_BIT))
#define DOUT7 54
#if (DOUT7_BIT < 32)
#define DOUT7_MUXREG __io_mux__(DOUT7_BIT)
#define DOUT7_OUT_CONFREG __io_out_conf__(DOUT7_BIT)
#define DOUT7_IN_CONFREG __io_in_conf__(DOUT7_BIT)
#define DOUT7_OUTREG OUT0
#define DOUT7_INREG IN0
#else
#define DOUT7_OUTREG OUT1
#define DOUT7_INREG IN1
#endif
#define DIO54 54
#define DIO54_BIT DOUT7_BIT
#define DIO54_MUXREG DOUT7_MUXREG
#define DIO54_OUT_CONFREG DOUT7_OUT_CONFREG
#define DIO54_IN_CONFREG DOUT7_IN_CONFREG
#define DIO54_OUTREG DOUT7_OUTREG
#define DIO54_INREG DOUT7_INREG
#endif
#if (defined(DOUT8_BIT))
#define DOUT8 55
#if (DOUT8_BIT < 32)
#define DOUT8_MUXREG __io_mux__(DOUT8_BIT)
#define DOUT8_OUT_CONFREG __io_out_conf__(DOUT8_BIT)
#define DOUT8_IN_CONFREG __io_in_conf__(DOUT8_BIT)
#define DOUT8_OUTREG OUT0
#define DOUT8_INREG IN0
#else
#define DOUT8_OUTREG OUT1
#define DOUT8_INREG IN1
#endif
#define DIO55 55
#define DIO55_BIT DOUT8_BIT
#define DIO55_MUXREG DOUT8_MUXREG
#define DIO55_OUT_CONFREG DOUT8_OUT_CONFREG
#define DIO55_IN_CONFREG DOUT8_IN_CONFREG
#define DIO55_OUTREG DOUT8_OUTREG
#define DIO55_INREG DOUT8_INREG
#endif
#if (defined(DOUT9_BIT))
#define DOUT9 56
#if (DOUT9_BIT < 32)
#define DOUT9_MUXREG __io_mux__(DOUT9_BIT)
#define DOUT9_OUT_CONFREG __io_out_conf__(DOUT9_BIT)
#define DOUT9_IN_CONFREG __io_in_conf__(DOUT9_BIT)
#define DOUT9_OUTREG OUT0
#define DOUT9_INREG IN0
#else
#define DOUT9_OUTREG OUT1
#define DOUT9_INREG IN1
#endif
#define DIO56 56
#define DIO56_BIT DOUT9_BIT
#define DIO56_MUXREG DOUT9_MUXREG
#define DIO56_OUT_CONFREG DOUT9_OUT_CONFREG
#define DIO56_IN_CONFREG DOUT9_IN_CONFREG
#define DIO56_OUTREG DOUT9_OUTREG
#define DIO56_INREG DOUT9_INREG
#endif
#if (defined(DOUT10_BIT))
#define DOUT10 57
#if (DOUT10_BIT < 32)
#define DOUT10_MUXREG __io_mux__(DOUT10_BIT)
#define DOUT10_OUT_CONFREG __io_out_conf__(DOUT10_BIT)
#define DOUT10_IN_CONFREG __io_in_conf__(DOUT10_BIT)
#define DOUT10_OUTREG OUT0
#define DOUT10_INREG IN0
#else
#define DOUT10_OUTREG OUT1
#define DOUT10_INREG IN1
#endif
#define DIO57 57
#define DIO57_BIT DOUT10_BIT
#define DIO57_MUXREG DOUT10_MUXREG
#define DIO57_OUT_CONFREG DOUT10_OUT_CONFREG
#define DIO57_IN_CONFREG DOUT10_IN_CONFREG
#define DIO57_OUTREG DOUT10_OUTREG
#define DIO57_INREG DOUT10_INREG
#endif
#if (defined(DOUT11_BIT))
#define DOUT11 58
#if (DOUT11_BIT < 32)
#define DOUT11_MUXREG __io_mux__(DOUT11_BIT)
#define DOUT11_OUT_CONFREG __io_out_conf__(DOUT11_BIT)
#define DOUT11_IN_CONFREG __io_in_conf__(DOUT11_BIT)
#define DOUT11_OUTREG OUT0
#define DOUT11_INREG IN0
#else
#define DOUT11_OUTREG OUT1
#define DOUT11_INREG IN1
#endif
#define DIO58 58
#define DIO58_BIT DOUT11_BIT
#define DIO58_MUXREG DOUT11_MUXREG
#define DIO58_OUT_CONFREG DOUT11_OUT_CONFREG
#define DIO58_IN_CONFREG DOUT11_IN_CONFREG
#define DIO58_OUTREG DOUT11_OUTREG
#define DIO58_INREG DOUT11_INREG
#endif
#if (defined(DOUT12_BIT))
#define DOUT12 59
#if (DOUT12_BIT < 32)
#define DOUT12_MUXREG __io_mux__(DOUT12_BIT)
#define DOUT12_OUT_CONFREG __io_out_conf__(DOUT12_BIT)
#define DOUT12_IN_CONFREG __io_in_conf__(DOUT12_BIT)
#define DOUT12_OUTREG OUT0
#define DOUT12_INREG IN0
#else
#define DOUT12_OUTREG OUT1
#define DOUT12_INREG IN1
#endif
#define DIO59 59
#define DIO59_BIT DOUT12_BIT
#define DIO59_MUXREG DOUT12_MUXREG
#define DIO59_OUT_CONFREG DOUT12_OUT_CONFREG
#define DIO59_IN_CONFREG DOUT12_IN_CONFREG
#define DIO59_OUTREG DOUT12_OUTREG
#define DIO59_INREG DOUT12_INREG
#endif
#if (defined(DOUT13_BIT))
#define DOUT13 60
#if (DOUT13_BIT < 32)
#define DOUT13_MUXREG __io_mux__(DOUT13_BIT)
#define DOUT13_OUT_CONFREG __io_out_conf__(DOUT13_BIT)
#define DOUT13_IN_CONFREG __io_in_conf__(DOUT13_BIT)
#define DOUT13_OUTREG OUT0
#define DOUT13_INREG IN0
#else
#define DOUT13_OUTREG OUT1
#define DOUT13_INREG IN1
#endif
#define DIO60 60
#define DIO60_BIT DOUT13_BIT
#define DIO60_MUXREG DOUT13_MUXREG
#define DIO60_OUT_CONFREG DOUT13_OUT_CONFREG
#define DIO60_IN_CONFREG DOUT13_IN_CONFREG
#define DIO60_OUTREG DOUT13_OUTREG
#define DIO60_INREG DOUT13_INREG
#endif
#if (defined(DOUT14_BIT))
#define DOUT14 61
#if (DOUT14_BIT < 32)
#define DOUT14_MUXREG __io_mux__(DOUT14_BIT)
#define DOUT14_OUT_CONFREG __io_out_conf__(DOUT14_BIT)
#define DOUT14_IN_CONFREG __io_in_conf__(DOUT14_BIT)
#define DOUT14_OUTREG OUT0
#define DOUT14_INREG IN0
#else
#define DOUT14_OUTREG OUT1
#define DOUT14_INREG IN1
#endif
#define DIO61 61
#define DIO61_BIT DOUT14_BIT
#define DIO61_MUXREG DOUT14_MUXREG
#define DIO61_OUT_CONFREG DOUT14_OUT_CONFREG
#define DIO61_IN_CONFREG DOUT14_IN_CONFREG
#define DIO61_OUTREG DOUT14_OUTREG
#define DIO61_INREG DOUT14_INREG
#endif
#if (defined(DOUT15_BIT))
#define DOUT15 62
#if (DOUT15_BIT < 32)
#define DOUT15_MUXREG __io_mux__(DOUT15_BIT)
#define DOUT15_OUT_CONFREG __io_out_conf__(DOUT15_BIT)
#define DOUT15_IN_CONFREG __io_in_conf__(DOUT15_BIT)
#define DOUT15_OUTREG OUT0
#define DOUT15_INREG IN0
#else
#define DOUT15_OUTREG OUT1
#define DOUT15_INREG IN1
#endif
#define DIO62 62
#define DIO62_BIT DOUT15_BIT
#define DIO62_MUXREG DOUT15_MUXREG
#define DIO62_OUT_CONFREG DOUT15_OUT_CONFREG
#define DIO62_IN_CONFREG DOUT15_IN_CONFREG
#define DIO62_OUTREG DOUT15_OUTREG
#define DIO62_INREG DOUT15_INREG
#endif
#if (defined(DOUT16_BIT))
#define DOUT16 63
#if (DOUT16_BIT < 32)
#define DOUT16_MUXREG __io_mux__(DOUT16_BIT)
#define DOUT16_OUT_CONFREG __io_out_conf__(DOUT16_BIT)
#define DOUT16_IN_CONFREG __io_in_conf__(DOUT16_BIT)
#define DOUT16_OUTREG OUT0
#define DOUT16_INREG IN0
#else
#define DOUT16_OUTREG OUT1
#define DOUT16_INREG IN1
#endif
#define DIO63 63
#define DIO63_BIT DOUT16_BIT
#define DIO63_MUXREG DOUT16_MUXREG
#define DIO63_OUT_CONFREG DOUT16_OUT_CONFREG
#define DIO63_IN_CONFREG DOUT16_IN_CONFREG
#define DIO63_OUTREG DOUT16_OUTREG
#define DIO63_INREG DOUT16_INREG
#endif
#if (defined(DOUT17_BIT))
#define DOUT17 64
#if (DOUT17_BIT < 32)
#define DOUT17_MUXREG __io_mux__(DOUT17_BIT)
#define DOUT17_OUT_CONFREG __io_out_conf__(DOUT17_BIT)
#define DOUT17_IN_CONFREG __io_in_conf__(DOUT17_BIT)
#define DOUT17_OUTREG OUT0
#define DOUT17_INREG IN0
#else
#define DOUT17_OUTREG OUT1
#define DOUT17_INREG IN1
#endif
#define DIO64 64
#define DIO64_BIT DOUT17_BIT
#define DIO64_MUXREG DOUT17_MUXREG
#define DIO64_OUT_CONFREG DOUT17_OUT_CONFREG
#define DIO64_IN_CONFREG DOUT17_IN_CONFREG
#define DIO64_OUTREG DOUT17_OUTREG
#define DIO64_INREG DOUT17_INREG
#endif
#if (defined(DOUT18_BIT))
#define DOUT18 65
#if (DOUT18_BIT < 32)
#define DOUT18_MUXREG __io_mux__(DOUT18_BIT)
#define DOUT18_OUT_CONFREG __io_out_conf__(DOUT18_BIT)
#define DOUT18_IN_CONFREG __io_in_conf__(DOUT18_BIT)
#define DOUT18_OUTREG OUT0
#define DOUT18_INREG IN0
#else
#define DOUT18_OUTREG OUT1
#define DOUT18_INREG IN1
#endif
#define DIO65 65
#define DIO65_BIT DOUT18_BIT
#define DIO65_MUXREG DOUT18_MUXREG
#define DIO65_OUT_CONFREG DOUT18_OUT_CONFREG
#define DIO65_IN_CONFREG DOUT18_IN_CONFREG
#define DIO65_OUTREG DOUT18_OUTREG
#define DIO65_INREG DOUT18_INREG
#endif
#if (defined(DOUT19_BIT))
#define DOUT19 66
#if (DOUT19_BIT < 32)
#define DOUT19_MUXREG __io_mux__(DOUT19_BIT)
#define DOUT19_OUT_CONFREG __io_out_conf__(DOUT19_BIT)
#define DOUT19_IN_CONFREG __io_in_conf__(DOUT19_BIT)
#define DOUT19_OUTREG OUT0
#define DOUT19_INREG IN0
#else
#define DOUT19_OUTREG OUT1
#define DOUT19_INREG IN1
#endif
#define DIO66 66
#define DIO66_BIT DOUT19_BIT
#define DIO66_MUXREG DOUT19_MUXREG
#define DIO66_OUT_CONFREG DOUT19_OUT_CONFREG
#define DIO66_IN_CONFREG DOUT19_IN_CONFREG
#define DIO66_OUTREG DOUT19_OUTREG
#define DIO66_INREG DOUT19_INREG
#endif
#if (defined(DOUT20_BIT))
#define DOUT20 67
#if (DOUT20_BIT < 32)
#define DOUT20_MUXREG __io_mux__(DOUT20_BIT)
#define DOUT20_OUT_CONFREG __io_out_conf__(DOUT20_BIT)
#define DOUT20_IN_CONFREG __io_in_conf__(DOUT20_BIT)
#define DOUT20_OUTREG OUT0
#define DOUT20_INREG IN0
#else
#define DOUT20_OUTREG OUT1
#define DOUT20_INREG IN1
#endif
#define DIO67 67
#define DIO67_BIT DOUT20_BIT
#define DIO67_MUXREG DOUT20_MUXREG
#define DIO67_OUT_CONFREG DOUT20_OUT_CONFREG
#define DIO67_IN_CONFREG DOUT20_IN_CONFREG
#define DIO67_OUTREG DOUT20_OUTREG
#define DIO67_INREG DOUT20_INREG
#endif
#if (defined(DOUT21_BIT))
#define DOUT21 68
#if (DOUT21_BIT < 32)
#define DOUT21_MUXREG __io_mux__(DOUT21_BIT)
#define DOUT21_OUT_CONFREG __io_out_conf__(DOUT21_BIT)
#define DOUT21_IN_CONFREG __io_in_conf__(DOUT21_BIT)
#define DOUT21_OUTREG OUT0
#define DOUT21_INREG IN0
#else
#define DOUT21_OUTREG OUT1
#define DOUT21_INREG IN1
#endif
#define DIO68 68
#define DIO68_BIT DOUT21_BIT
#define DIO68_MUXREG DOUT21_MUXREG
#define DIO68_OUT_CONFREG DOUT21_OUT_CONFREG
#define DIO68_IN_CONFREG DOUT21_IN_CONFREG
#define DIO68_OUTREG DOUT21_OUTREG
#define DIO68_INREG DOUT21_INREG
#endif
#if (defined(DOUT22_BIT))
#define DOUT22 69
#if (DOUT22_BIT < 32)
#define DOUT22_MUXREG __io_mux__(DOUT22_BIT)
#define DOUT22_OUT_CONFREG __io_out_conf__(DOUT22_BIT)
#define DOUT22_IN_CONFREG __io_in_conf__(DOUT22_BIT)
#define DOUT22_OUTREG OUT0
#define DOUT22_INREG IN0
#else
#define DOUT22_OUTREG OUT1
#define DOUT22_INREG IN1
#endif
#define DIO69 69
#define DIO69_BIT DOUT22_BIT
#define DIO69_MUXREG DOUT22_MUXREG
#define DIO69_OUT_CONFREG DOUT22_OUT_CONFREG
#define DIO69_IN_CONFREG DOUT22_IN_CONFREG
#define DIO69_OUTREG DOUT22_OUTREG
#define DIO69_INREG DOUT22_INREG
#endif
#if (defined(DOUT23_BIT))
#define DOUT23 70
#if (DOUT23_BIT < 32)
#define DOUT23_MUXREG __io_mux__(DOUT23_BIT)
#define DOUT23_OUT_CONFREG __io_out_conf__(DOUT23_BIT)
#define DOUT23_IN_CONFREG __io_in_conf__(DOUT23_BIT)
#define DOUT23_OUTREG OUT0
#define DOUT23_INREG IN0
#else
#define DOUT23_OUTREG OUT1
#define DOUT23_INREG IN1
#endif
#define DIO70 70
#define DIO70_BIT DOUT23_BIT
#define DIO70_MUXREG DOUT23_MUXREG
#define DIO70_OUT_CONFREG DOUT23_OUT_CONFREG
#define DIO70_IN_CONFREG DOUT23_IN_CONFREG
#define DIO70_OUTREG DOUT23_OUTREG
#define DIO70_INREG DOUT23_INREG
#endif
#if (defined(DOUT24_BIT))
#define DOUT24 71
#if (DOUT24_BIT < 32)
#define DOUT24_MUXREG __io_mux__(DOUT24_BIT)
#define DOUT24_OUT_CONFREG __io_out_conf__(DOUT24_BIT)
#define DOUT24_IN_CONFREG __io_in_conf__(DOUT24_BIT)
#define DOUT24_OUTREG OUT0
#define DOUT24_INREG IN0
#else
#define DOUT24_OUTREG OUT1
#define DOUT24_INREG IN1
#endif
#define DIO71 71
#define DIO71_BIT DOUT24_BIT
#define DIO71_MUXREG DOUT24_MUXREG
#define DIO71_OUT_CONFREG DOUT24_OUT_CONFREG
#define DIO71_IN_CONFREG DOUT24_IN_CONFREG
#define DIO71_OUTREG DOUT24_OUTREG
#define DIO71_INREG DOUT24_INREG
#endif
#if (defined(DOUT25_BIT))
#define DOUT25 72
#if (DOUT25_BIT < 32)
#define DOUT25_MUXREG __io_mux__(DOUT25_BIT)
#define DOUT25_OUT_CONFREG __io_out_conf__(DOUT25_BIT)
#define DOUT25_IN_CONFREG __io_in_conf__(DOUT25_BIT)
#define DOUT25_OUTREG OUT0
#define DOUT25_INREG IN0
#else
#define DOUT25_OUTREG OUT1
#define DOUT25_INREG IN1
#endif
#define DIO72 72
#define DIO72_BIT DOUT25_BIT
#define DIO72_MUXREG DOUT25_MUXREG
#define DIO72_OUT_CONFREG DOUT25_OUT_CONFREG
#define DIO72_IN_CONFREG DOUT25_IN_CONFREG
#define DIO72_OUTREG DOUT25_OUTREG
#define DIO72_INREG DOUT25_INREG
#endif
#if (defined(DOUT26_BIT))
#define DOUT26 73
#if (DOUT26_BIT < 32)
#define DOUT26_MUXREG __io_mux__(DOUT26_BIT)
#define DOUT26_OUT_CONFREG __io_out_conf__(DOUT26_BIT)
#define DOUT26_IN_CONFREG __io_in_conf__(DOUT26_BIT)
#define DOUT26_OUTREG OUT0
#define DOUT26_INREG IN0
#else
#define DOUT26_OUTREG OUT1
#define DOUT26_INREG IN1
#endif
#define DIO73 73
#define DIO73_BIT DOUT26_BIT
#define DIO73_MUXREG DOUT26_MUXREG
#define DIO73_OUT_CONFREG DOUT26_OUT_CONFREG
#define DIO73_IN_CONFREG DOUT26_IN_CONFREG
#define DIO73_OUTREG DOUT26_OUTREG
#define DIO73_INREG DOUT26_INREG
#endif
#if (defined(DOUT27_BIT))
#define DOUT27 74
#if (DOUT27_BIT < 32)
#define DOUT27_MUXREG __io_mux__(DOUT27_BIT)
#define DOUT27_OUT_CONFREG __io_out_conf__(DOUT27_BIT)
#define DOUT27_IN_CONFREG __io_in_conf__(DOUT27_BIT)
#define DOUT27_OUTREG OUT0
#define DOUT27_INREG IN0
#else
#define DOUT27_OUTREG OUT1
#define DOUT27_INREG IN1
#endif
#define DIO74 74
#define DIO74_BIT DOUT27_BIT
#define DIO74_MUXREG DOUT27_MUXREG
#define DIO74_OUT_CONFREG DOUT27_OUT_CONFREG
#define DIO74_IN_CONFREG DOUT27_IN_CONFREG
#define DIO74_OUTREG DOUT27_OUTREG
#define DIO74_INREG DOUT27_INREG
#endif
#if (defined(DOUT28_BIT))
#define DOUT28 75
#if (DOUT28_BIT < 32)
#define DOUT28_MUXREG __io_mux__(DOUT28_BIT)
#define DOUT28_OUT_CONFREG __io_out_conf__(DOUT28_BIT)
#define DOUT28_IN_CONFREG __io_in_conf__(DOUT28_BIT)
#define DOUT28_OUTREG OUT0
#define DOUT28_INREG IN0
#else
#define DOUT28_OUTREG OUT1
#define DOUT28_INREG IN1
#endif
#define DIO75 75
#define DIO75_BIT DOUT28_BIT
#define DIO75_MUXREG DOUT28_MUXREG
#define DIO75_OUT_CONFREG DOUT28_OUT_CONFREG
#define DIO75_IN_CONFREG DOUT28_IN_CONFREG
#define DIO75_OUTREG DOUT28_OUTREG
#define DIO75_INREG DOUT28_INREG
#endif
#if (defined(DOUT29_BIT))
#define DOUT29 76
#if (DOUT29_BIT < 32)
#define DOUT29_MUXREG __io_mux__(DOUT29_BIT)
#define DOUT29_OUT_CONFREG __io_out_conf__(DOUT29_BIT)
#define DOUT29_IN_CONFREG __io_in_conf__(DOUT29_BIT)
#define DOUT29_OUTREG OUT0
#define DOUT29_INREG IN0
#else
#define DOUT29_OUTREG OUT1
#define DOUT29_INREG IN1
#endif
#define DIO76 76
#define DIO76_BIT DOUT29_BIT
#define DIO76_MUXREG DOUT29_MUXREG
#define DIO76_OUT_CONFREG DOUT29_OUT_CONFREG
#define DIO76_IN_CONFREG DOUT29_IN_CONFREG
#define DIO76_OUTREG DOUT29_OUTREG
#define DIO76_INREG DOUT29_INREG
#endif
#if (defined(DOUT30_BIT))
#define DOUT30 77
#if (DOUT30_BIT < 32)
#define DOUT30_MUXREG __io_mux__(DOUT30_BIT)
#define DOUT30_OUT_CONFREG __io_out_conf__(DOUT30_BIT)
#define DOUT30_IN_CONFREG __io_in_conf__(DOUT30_BIT)
#define DOUT30_OUTREG OUT0
#define DOUT30_INREG IN0
#else
#define DOUT30_OUTREG OUT1
#define DOUT30_INREG IN1
#endif
#define DIO77 77
#define DIO77_BIT DOUT30_BIT
#define DIO77_MUXREG DOUT30_MUXREG
