Paciente8159/uCNC/uCNC/src/hal/mcus/esp32s/mcumap_esp32s.h
#define DIO162_OUT_CONFREG DIN32_OUT_CONFREG
#define DIO162_IN_CONFREG DIN32_IN_CONFREG
#define DIO162_OUTREG DIN32_OUTREG
#define DIO162_INREG DIN32_INREG
#endif
#if (defined(DIN33_BIT))
#define DIN33 163
#if (DIN33_BIT < 32)
#define DIN33_MUXREG __io_mux__(DIN33_BIT)
#define DIN33_OUT_CONFREG __io_out_conf__(DIN33_BIT)
#define DIN33_IN_CONFREG __io_in_conf__(DIN33_BIT)
#define DIN33_OUTREG OUT0
#define DIN33_INREG IN0
#else
#define DIN33_OUTREG OUT1
#define DIN33_INREG IN1
#endif
#define DIO163 163
#define DIO163_BIT DIN33_BIT
#define DIO163_MUXREG DIN33_MUXREG
#define DIO163_OUT_CONFREG DIN33_OUT_CONFREG
#define DIO163_IN_CONFREG DIN33_IN_CONFREG
#define DIO163_OUTREG DIN33_OUTREG
#define DIO163_INREG DIN33_INREG
#endif
#if (defined(DIN34_BIT))
#define DIN34 164
#if (DIN34_BIT < 32)
#define DIN34_MUXREG __io_mux__(DIN34_BIT)
#define DIN34_OUT_CONFREG __io_out_conf__(DIN34_BIT)
#define DIN34_IN_CONFREG __io_in_conf__(DIN34_BIT)
#define DIN34_OUTREG OUT0
#define DIN34_INREG IN0
#else
#define DIN34_OUTREG OUT1
#define DIN34_INREG IN1
#endif
#define DIO164 164
#define DIO164_BIT DIN34_BIT
#define DIO164_MUXREG DIN34_MUXREG
#define DIO164_OUT_CONFREG DIN34_OUT_CONFREG
#define DIO164_IN_CONFREG DIN34_IN_CONFREG
#define DIO164_OUTREG DIN34_OUTREG
#define DIO164_INREG DIN34_INREG
#endif
#if (defined(DIN35_BIT))
#define DIN35 165
#if (DIN35_BIT < 32)
#define DIN35_MUXREG __io_mux__(DIN35_BIT)
#define DIN35_OUT_CONFREG __io_out_conf__(DIN35_BIT)
#define DIN35_IN_CONFREG __io_in_conf__(DIN35_BIT)
#define DIN35_OUTREG OUT0
#define DIN35_INREG IN0
#else
#define DIN35_OUTREG OUT1
#define DIN35_INREG IN1
#endif
#define DIO165 165
#define DIO165_BIT DIN35_BIT
#define DIO165_MUXREG DIN35_MUXREG
#define DIO165_OUT_CONFREG DIN35_OUT_CONFREG
#define DIO165_IN_CONFREG DIN35_IN_CONFREG
#define DIO165_OUTREG DIN35_OUTREG
#define DIO165_INREG DIN35_INREG
#endif
#if (defined(DIN36_BIT))
#define DIN36 166
#if (DIN36_BIT < 32)
#define DIN36_MUXREG __io_mux__(DIN36_BIT)
#define DIN36_OUT_CONFREG __io_out_conf__(DIN36_BIT)
#define DIN36_IN_CONFREG __io_in_conf__(DIN36_BIT)
#define DIN36_OUTREG OUT0
#define DIN36_INREG IN0
#else
#define DIN36_OUTREG OUT1
#define DIN36_INREG IN1
#endif
#define DIO166 166
#define DIO166_BIT DIN36_BIT
#define DIO166_MUXREG DIN36_MUXREG
#define DIO166_OUT_CONFREG DIN36_OUT_CONFREG
#define DIO166_IN_CONFREG DIN36_IN_CONFREG
#define DIO166_OUTREG DIN36_OUTREG
#define DIO166_INREG DIN36_INREG
#endif
#if (defined(DIN37_BIT))
#define DIN37 167
#if (DIN37_BIT < 32)
#define DIN37_MUXREG __io_mux__(DIN37_BIT)
#define DIN37_OUT_CONFREG __io_out_conf__(DIN37_BIT)
#define DIN37_IN_CONFREG __io_in_conf__(DIN37_BIT)
#define DIN37_OUTREG OUT0
#define DIN37_INREG IN0
#else
#define DIN37_OUTREG OUT1
#define DIN37_INREG IN1
#endif
#define DIO167 167
#define DIO167_BIT DIN37_BIT
#define DIO167_MUXREG DIN37_MUXREG
#define DIO167_OUT_CONFREG DIN37_OUT_CONFREG
#define DIO167_IN_CONFREG DIN37_IN_CONFREG
#define DIO167_OUTREG DIN37_OUTREG
#define DIO167_INREG DIN37_INREG
#endif
#if (defined(DIN38_BIT))
#define DIN38 168
#if (DIN38_BIT < 32)
#define DIN38_MUXREG __io_mux__(DIN38_BIT)
#define DIN38_OUT_CONFREG __io_out_conf__(DIN38_BIT)
#define DIN38_IN_CONFREG __io_in_conf__(DIN38_BIT)
#define DIN38_OUTREG OUT0
#define DIN38_INREG IN0
#else
#define DIN38_OUTREG OUT1
#define DIN38_INREG IN1
#endif
#define DIO168 168
#define DIO168_BIT DIN38_BIT
#define DIO168_MUXREG DIN38_MUXREG
#define DIO168_OUT_CONFREG DIN38_OUT_CONFREG
#define DIO168_IN_CONFREG DIN38_IN_CONFREG
#define DIO168_OUTREG DIN38_OUTREG
#define DIO168_INREG DIN38_INREG
#endif
#if (defined(DIN39_BIT))
#define DIN39 169
#if (DIN39_BIT < 32)
#define DIN39_MUXREG __io_mux__(DIN39_BIT)
#define DIN39_OUT_CONFREG __io_out_conf__(DIN39_BIT)
#define DIN39_IN_CONFREG __io_in_conf__(DIN39_BIT)
#define DIN39_OUTREG OUT0
#define DIN39_INREG IN0
#else
#define DIN39_OUTREG OUT1
#define DIN39_INREG IN1
#endif
#define DIO169 169
#define DIO169_BIT DIN39_BIT
#define DIO169_MUXREG DIN39_MUXREG
#define DIO169_OUT_CONFREG DIN39_OUT_CONFREG
#define DIO169_IN_CONFREG DIN39_IN_CONFREG
#define DIO169_OUTREG DIN39_OUTREG
#define DIO169_INREG DIN39_INREG
#endif
#if (defined(DIN40_BIT))
#define DIN40 170
#if (DIN40_BIT < 32)
#define DIN40_MUXREG __io_mux__(DIN40_BIT)
#define DIN40_OUT_CONFREG __io_out_conf__(DIN40_BIT)
#define DIN40_IN_CONFREG __io_in_conf__(DIN40_BIT)
#define DIN40_OUTREG OUT0
#define DIN40_INREG IN0
#else
#define DIN40_OUTREG OUT1
#define DIN40_INREG IN1
#endif
#define DIO170 170
#define DIO170_BIT DIN40_BIT
#define DIO170_MUXREG DIN40_MUXREG
#define DIO170_OUT_CONFREG DIN40_OUT_CONFREG
#define DIO170_IN_CONFREG DIN40_IN_CONFREG
#define DIO170_OUTREG DIN40_OUTREG
#define DIO170_INREG DIN40_INREG
#endif
#if (defined(DIN41_BIT))
#define DIN41 171
#if (DIN41_BIT < 32)
#define DIN41_MUXREG __io_mux__(DIN41_BIT)
#define DIN41_OUT_CONFREG __io_out_conf__(DIN41_BIT)
#define DIN41_IN_CONFREG __io_in_conf__(DIN41_BIT)
#define DIN41_OUTREG OUT0
#define DIN41_INREG IN0
#else
#define DIN41_OUTREG OUT1
#define DIN41_INREG IN1
#endif
#define DIO171 171
#define DIO171_BIT DIN41_BIT
#define DIO171_MUXREG DIN41_MUXREG
#define DIO171_OUT_CONFREG DIN41_OUT_CONFREG
#define DIO171_IN_CONFREG DIN41_IN_CONFREG
#define DIO171_OUTREG DIN41_OUTREG
#define DIO171_INREG DIN41_INREG
#endif
#if (defined(DIN42_BIT))
#define DIN42 172
#if (DIN42_BIT < 32)
#define DIN42_MUXREG __io_mux__(DIN42_BIT)
#define DIN42_OUT_CONFREG __io_out_conf__(DIN42_BIT)
#define DIN42_IN_CONFREG __io_in_conf__(DIN42_BIT)
#define DIN42_OUTREG OUT0
#define DIN42_INREG IN0
#else
#define DIN42_OUTREG OUT1
#define DIN42_INREG IN1
#endif
#define DIO172 172
#define DIO172_BIT DIN42_BIT
#define DIO172_MUXREG DIN42_MUXREG
#define DIO172_OUT_CONFREG DIN42_OUT_CONFREG
#define DIO172_IN_CONFREG DIN42_IN_CONFREG
#define DIO172_OUTREG DIN42_OUTREG
#define DIO172_INREG DIN42_INREG
#endif
#if (defined(DIN43_BIT))
#define DIN43 173
#if (DIN43_BIT < 32)
#define DIN43_MUXREG __io_mux__(DIN43_BIT)
#define DIN43_OUT_CONFREG __io_out_conf__(DIN43_BIT)
#define DIN43_IN_CONFREG __io_in_conf__(DIN43_BIT)
#define DIN43_OUTREG OUT0
#define DIN43_INREG IN0
#else
#define DIN43_OUTREG OUT1
#define DIN43_INREG IN1
#endif
#define DIO173 173
#define DIO173_BIT DIN43_BIT
#define DIO173_MUXREG DIN43_MUXREG
#define DIO173_OUT_CONFREG DIN43_OUT_CONFREG
#define DIO173_IN_CONFREG DIN43_IN_CONFREG
#define DIO173_OUTREG DIN43_OUTREG
#define DIO173_INREG DIN43_INREG
#endif
#if (defined(DIN44_BIT))
#define DIN44 174
#if (DIN44_BIT < 32)
#define DIN44_MUXREG __io_mux__(DIN44_BIT)
#define DIN44_OUT_CONFREG __io_out_conf__(DIN44_BIT)
#define DIN44_IN_CONFREG __io_in_conf__(DIN44_BIT)
#define DIN44_OUTREG OUT0
#define DIN44_INREG IN0
#else
#define DIN44_OUTREG OUT1
#define DIN44_INREG IN1
#endif
#define DIO174 174
#define DIO174_BIT DIN44_BIT
#define DIO174_MUXREG DIN44_MUXREG
#define DIO174_OUT_CONFREG DIN44_OUT_CONFREG
#define DIO174_IN_CONFREG DIN44_IN_CONFREG
#define DIO174_OUTREG DIN44_OUTREG
#define DIO174_INREG DIN44_INREG
#endif
#if (defined(DIN45_BIT))
#define DIN45 175
#if (DIN45_BIT < 32)
#define DIN45_MUXREG __io_mux__(DIN45_BIT)
#define DIN45_OUT_CONFREG __io_out_conf__(DIN45_BIT)
#define DIN45_IN_CONFREG __io_in_conf__(DIN45_BIT)
#define DIN45_OUTREG OUT0
#define DIN45_INREG IN0
#else
#define DIN45_OUTREG OUT1
#define DIN45_INREG IN1
#endif
#define DIO175 175
#define DIO175_BIT DIN45_BIT
#define DIO175_MUXREG DIN45_MUXREG
#define DIO175_OUT_CONFREG DIN45_OUT_CONFREG
#define DIO175_IN_CONFREG DIN45_IN_CONFREG
#define DIO175_OUTREG DIN45_OUTREG
#define DIO175_INREG DIN45_INREG
#endif
#if (defined(DIN46_BIT))
#define DIN46 176
#if (DIN46_BIT < 32)
#define DIN46_MUXREG __io_mux__(DIN46_BIT)
#define DIN46_OUT_CONFREG __io_out_conf__(DIN46_BIT)
#define DIN46_IN_CONFREG __io_in_conf__(DIN46_BIT)
#define DIN46_OUTREG OUT0
#define DIN46_INREG IN0
#else
#define DIN46_OUTREG OUT1
#define DIN46_INREG IN1
#endif
#define DIO176 176
#define DIO176_BIT DIN46_BIT
#define DIO176_MUXREG DIN46_MUXREG
#define DIO176_OUT_CONFREG DIN46_OUT_CONFREG
#define DIO176_IN_CONFREG DIN46_IN_CONFREG
#define DIO176_OUTREG DIN46_OUTREG
#define DIO176_INREG DIN46_INREG
#endif
#if (defined(DIN47_BIT))
#define DIN47 177
#if (DIN47_BIT < 32)
#define DIN47_MUXREG __io_mux__(DIN47_BIT)
#define DIN47_OUT_CONFREG __io_out_conf__(DIN47_BIT)
#define DIN47_IN_CONFREG __io_in_conf__(DIN47_BIT)
#define DIN47_OUTREG OUT0
#define DIN47_INREG IN0
#else
#define DIN47_OUTREG OUT1
#define DIN47_INREG IN1
#endif
#define DIO177 177
#define DIO177_BIT DIN47_BIT
#define DIO177_MUXREG DIN47_MUXREG
#define DIO177_OUT_CONFREG DIN47_OUT_CONFREG
#define DIO177_IN_CONFREG DIN47_IN_CONFREG
#define DIO177_OUTREG DIN47_OUTREG
#define DIO177_INREG DIN47_INREG
#endif
#if (defined(DIN48_BIT))
#define DIN48 178
#if (DIN48_BIT < 32)
#define DIN48_MUXREG __io_mux__(DIN48_BIT)
#define DIN48_OUT_CONFREG __io_out_conf__(DIN48_BIT)
#define DIN48_IN_CONFREG __io_in_conf__(DIN48_BIT)
#define DIN48_OUTREG OUT0
#define DIN48_INREG IN0
#else
#define DIN48_OUTREG OUT1
#define DIN48_INREG IN1
#endif
#define DIO178 178
#define DIO178_BIT DIN48_BIT
#define DIO178_MUXREG DIN48_MUXREG
#define DIO178_OUT_CONFREG DIN48_OUT_CONFREG
#define DIO178_IN_CONFREG DIN48_IN_CONFREG
#define DIO178_OUTREG DIN48_OUTREG
#define DIO178_INREG DIN48_INREG
#endif
#if (defined(DIN49_BIT))
#define DIN49 179
#if (DIN49_BIT < 32)
#define DIN49_MUXREG __io_mux__(DIN49_BIT)
#define DIN49_OUT_CONFREG __io_out_conf__(DIN49_BIT)
#define DIN49_IN_CONFREG __io_in_conf__(DIN49_BIT)
#define DIN49_OUTREG OUT0
#define DIN49_INREG IN0
#else
#define DIN49_OUTREG OUT1
#define DIN49_INREG IN1
#endif
#define DIO179 179
#define DIO179_BIT DIN49_BIT
#define DIO179_MUXREG DIN49_MUXREG
#define DIO179_OUT_CONFREG DIN49_OUT_CONFREG
#define DIO179_IN_CONFREG DIN49_IN_CONFREG
#define DIO179_OUTREG DIN49_OUTREG
#define DIO179_INREG DIN49_INREG
#endif
#if (defined(_BIT))
#define
#if (_BIT < 32)
#define _MUXREG __io_mux__(_BIT)
#define _OUT_CONFREG __io_out_conf__(_BIT)
#define _IN_CONFREG __io_in_conf__(_BIT)
#define _OUTREG OUT0
#define _INREG IN0
#else
#define _OUTREG OUT1
#define _INREG IN1
#endif
#define
#define _BIT _BIT
#define _MUXREG _MUXREG
#define _OUT_CONFREG _OUT_CONFREG
#define _IN_CONFREG _IN_CONFREG
#define _OUTREG _OUTREG
#define _INREG _INREG
#endif
#if (defined(TX_BIT))
#define TX 200
#if (TX_BIT < 32)
#define TX_MUXREG __io_mux__(TX_BIT)
#define TX_OUT_CONFREG __io_out_conf__(TX_BIT)
#define TX_IN_CONFREG __io_in_conf__(TX_BIT)
#define TX_OUTREG OUT0
#define TX_INREG IN0
#else
#define TX_OUTREG OUT1
#define TX_INREG IN1
#endif
#define DIO200 200
#define DIO200_BIT TX_BIT
#define DIO200_MUXREG TX_MUXREG
#define DIO200_OUT_CONFREG TX_OUT_CONFREG
#define DIO200_IN_CONFREG TX_IN_CONFREG
#define DIO200_OUTREG TX_OUTREG
#define DIO200_INREG TX_INREG
#endif
#if (defined(RX_BIT))
#define RX 201
#if (RX_BIT < 32)
#define RX_MUXREG __io_mux__(RX_BIT)
#define RX_OUT_CONFREG __io_out_conf__(RX_BIT)
#define RX_IN_CONFREG __io_in_conf__(RX_BIT)
#define RX_OUTREG OUT0
#define RX_INREG IN0
#else
#define RX_OUTREG OUT1
#define RX_INREG IN1
#endif
#define DIO201 201
#define DIO201_BIT RX_BIT
#define DIO201_MUXREG RX_MUXREG
#define DIO201_OUT_CONFREG RX_OUT_CONFREG
#define DIO201_IN_CONFREG RX_IN_CONFREG
#define DIO201_OUTREG RX_OUTREG
#define DIO201_INREG RX_INREG
#endif
#if (defined(USB_DM_BIT))
#define USB_DM 202
#if (USB_DM_BIT < 32)
#define USB_DM_MUXREG __io_mux__(USB_DM_BIT)
#define USB_DM_OUT_CONFREG __io_out_conf__(USB_DM_BIT)
#define USB_DM_IN_CONFREG __io_in_conf__(USB_DM_BIT)
#define USB_DM_OUTREG OUT0
#define USB_DM_INREG IN0
#else
#define USB_DM_OUTREG OUT1
#define USB_DM_INREG IN1
#endif
#define DIO202 202
#define DIO202_BIT USB_DM_BIT
#define DIO202_MUXREG USB_DM_MUXREG
#define DIO202_OUT_CONFREG USB_DM_OUT_CONFREG
#define DIO202_IN_CONFREG USB_DM_IN_CONFREG
#define DIO202_OUTREG USB_DM_OUTREG
#define DIO202_INREG USB_DM_INREG
#endif
#if (defined(USB_DP_BIT))
#define USB_DP 203
#if (USB_DP_BIT < 32)
#define USB_DP_MUXREG __io_mux__(USB_DP_BIT)
#define USB_DP_OUT_CONFREG __io_out_conf__(USB_DP_BIT)
#define USB_DP_IN_CONFREG __io_in_conf__(USB_DP_BIT)
#define USB_DP_OUTREG OUT0
#define USB_DP_INREG IN0
#else
#define USB_DP_OUTREG OUT1
#define USB_DP_INREG IN1
#endif
#define DIO203 203
#define DIO203_BIT USB_DP_BIT
#define DIO203_MUXREG USB_DP_MUXREG
#define DIO203_OUT_CONFREG USB_DP_OUT_CONFREG
#define DIO203_IN_CONFREG USB_DP_IN_CONFREG
#define DIO203_OUTREG USB_DP_OUTREG
#define DIO203_INREG USB_DP_INREG
#endif
#if (defined(SPI_CLK_BIT))
#define SPI_CLK 204
#if (SPI_CLK_BIT < 32)
#define SPI_CLK_MUXREG __io_mux__(SPI_CLK_BIT)
#define SPI_CLK_OUT_CONFREG __io_out_conf__(SPI_CLK_BIT)
#define SPI_CLK_IN_CONFREG __io_in_conf__(SPI_CLK_BIT)
#define SPI_CLK_OUTREG OUT0
#define SPI_CLK_INREG IN0
#else
#define SPI_CLK_OUTREG OUT1
#define SPI_CLK_INREG IN1
#endif
#define DIO204 204
#define DIO204_BIT SPI_CLK_BIT
#define DIO204_MUXREG SPI_CLK_MUXREG
#define DIO204_OUT_CONFREG SPI_CLK_OUT_CONFREG
#define DIO204_IN_CONFREG SPI_CLK_IN_CONFREG
#define DIO204_OUTREG SPI_CLK_OUTREG
#define DIO204_INREG SPI_CLK_INREG
#endif
#if (defined(SPI_SDI_BIT))
#define SPI_SDI 205
#if (SPI_SDI_BIT < 32)
#define SPI_SDI_MUXREG __io_mux__(SPI_SDI_BIT)
#define SPI_SDI_OUT_CONFREG __io_out_conf__(SPI_SDI_BIT)
#define SPI_SDI_IN_CONFREG __io_in_conf__(SPI_SDI_BIT)
#define SPI_SDI_OUTREG OUT0
#define SPI_SDI_INREG IN0
#else
#define SPI_SDI_OUTREG OUT1
#define SPI_SDI_INREG IN1
#endif
#define DIO205 205
#define DIO205_BIT SPI_SDI_BIT
#define DIO205_MUXREG SPI_SDI_MUXREG
#define DIO205_OUT_CONFREG SPI_SDI_OUT_CONFREG
#define DIO205_IN_CONFREG SPI_SDI_IN_CONFREG
#define DIO205_OUTREG SPI_SDI_OUTREG
#define DIO205_INREG SPI_SDI_INREG
#endif
#if (defined(SPI_SDO_BIT))
#define SPI_SDO 206
#if (SPI_SDO_BIT < 32)
#define SPI_SDO_MUXREG __io_mux__(SPI_SDO_BIT)
#define SPI_SDO_OUT_CONFREG __io_out_conf__(SPI_SDO_BIT)
#define SPI_SDO_IN_CONFREG __io_in_conf__(SPI_SDO_BIT)
#define SPI_SDO_OUTREG OUT0
#define SPI_SDO_INREG IN0
#else
#define SPI_SDO_OUTREG OUT1
#define SPI_SDO_INREG IN1
#endif
#define DIO206 206
#define DIO206_BIT SPI_SDO_BIT
#define DIO206_MUXREG SPI_SDO_MUXREG
#define DIO206_OUT_CONFREG SPI_SDO_OUT_CONFREG
#define DIO206_IN_CONFREG SPI_SDO_IN_CONFREG
#define DIO206_OUTREG SPI_SDO_OUTREG
#define DIO206_INREG SPI_SDO_INREG
#endif
#if (defined(SPI_CS_BIT))
#define SPI_CS 207
#if (SPI_CS_BIT < 32)
#define SPI_CS_MUXREG __io_mux__(SPI_CS_BIT)
#define SPI_CS_OUT_CONFREG __io_out_conf__(SPI_CS_BIT)
#define SPI_CS_IN_CONFREG __io_in_conf__(SPI_CS_BIT)
#define SPI_CS_OUTREG OUT0
#define SPI_CS_INREG IN0
#else
#define SPI_CS_OUTREG OUT1
#define SPI_CS_INREG IN1
#endif
#define DIO207 207
#define DIO207_BIT SPI_CS_BIT
#define DIO207_MUXREG SPI_CS_MUXREG
#define DIO207_OUT_CONFREG SPI_CS_OUT_CONFREG
#define DIO207_IN_CONFREG SPI_CS_IN_CONFREG
#define DIO207_OUTREG SPI_CS_OUTREG
#define DIO207_INREG SPI_CS_INREG
#endif
#if (defined(I2C_SCL_BIT))
#define I2C_SCL 208
#if (I2C_SCL_BIT < 32)
#define I2C_SCL_MUXREG __io_mux__(I2C_SCL_BIT)
#define I2C_SCL_OUT_CONFREG __io_out_conf__(I2C_SCL_BIT)
#define I2C_SCL_IN_CONFREG __io_in_conf__(I2C_SCL_BIT)
#define I2C_SCL_OUTREG OUT0
#define I2C_SCL_INREG IN0
#else
#define I2C_SCL_OUTREG OUT1
#define I2C_SCL_INREG IN1
#endif
#define DIO208 208
#define DIO208_BIT I2C_SCL_BIT
#define DIO208_MUXREG I2C_SCL_MUXREG
#define DIO208_OUT_CONFREG I2C_SCL_OUT_CONFREG
#define DIO208_IN_CONFREG I2C_SCL_IN_CONFREG
#define DIO208_OUTREG I2C_SCL_OUTREG
#define DIO208_INREG I2C_SCL_INREG
#endif
#if (defined(I2C_SDA_BIT))
#define I2C_SDA 209
#if (I2C_SDA_BIT < 32)
#define I2C_SDA_MUXREG __io_mux__(I2C_SDA_BIT)
#define I2C_SDA_OUT_CONFREG __io_out_conf__(I2C_SDA_BIT)
#define I2C_SDA_IN_CONFREG __io_in_conf__(I2C_SDA_BIT)
#define I2C_SDA_OUTREG OUT0
#define I2C_SDA_INREG IN0
#else
#define I2C_SDA_OUTREG OUT1
#define I2C_SDA_INREG IN1
#endif
#define DIO209 209
#define DIO209_BIT I2C_SDA_BIT
#define DIO209_MUXREG I2C_SDA_MUXREG
#define DIO209_OUT_CONFREG I2C_SDA_OUT_CONFREG
#define DIO209_IN_CONFREG I2C_SDA_IN_CONFREG
#define DIO209_OUTREG I2C_SDA_OUTREG
#define DIO209_INREG I2C_SDA_INREG
#endif
#if (defined(TX2_BIT))
#define TX2 210
#if (TX2_BIT < 32)
#define TX2_MUXREG __io_mux__(TX2_BIT)
#define TX2_OUT_CONFREG __io_out_conf__(TX2_BIT)
#define TX2_IN_CONFREG __io_in_conf__(TX2_BIT)
#define TX2_OUTREG OUT0
#define TX2_INREG IN0
#else
#define TX2_OUTREG OUT1
#define TX2_INREG IN1
#endif
#define DIO210 210
#define DIO210_BIT TX2_BIT
#define DIO210_MUXREG TX2_MUXREG
#define DIO210_OUT_CONFREG TX2_OUT_CONFREG
#define DIO210_IN_CONFREG TX2_IN_CONFREG
#define DIO210_OUTREG TX2_OUTREG
#define DIO210_INREG TX2_INREG
#endif
#if (defined(RX2_BIT))
#define RX2 211
#if (RX2_BIT < 32)
#define RX2_MUXREG __io_mux__(RX2_BIT)
#define RX2_OUT_CONFREG __io_out_conf__(RX2_BIT)
#define RX2_IN_CONFREG __io_in_conf__(RX2_BIT)
#define RX2_OUTREG OUT0
#define RX2_INREG IN0
#else
#define RX2_OUTREG OUT1
#define RX2_INREG IN1
#endif
#define DIO211 211
#define DIO211_BIT RX2_BIT
#define DIO211_MUXREG RX2_MUXREG
#define DIO211_OUT_CONFREG RX2_OUT_CONFREG
#define DIO211_IN_CONFREG RX2_IN_CONFREG
#define DIO211_OUTREG RX2_OUTREG
#define DIO211_INREG RX2_INREG
#endif
#if (defined(SPI2_CLK_BIT))
#define SPI2_CLK 212
#if (SPI2_CLK_BIT < 32)
#define SPI2_CLK_MUXREG __io_mux__(SPI2_CLK_BIT)
#define SPI2_CLK_OUT_CONFREG __io_out_conf__(SPI2_CLK_BIT)
#define SPI2_CLK_IN_CONFREG __io_in_conf__(SPI2_CLK_BIT)
#define SPI2_CLK_OUTREG OUT0
#define SPI2_CLK_INREG IN0
#else
#define SPI2_CLK_OUTREG OUT1
#define SPI2_CLK_INREG IN1
#endif
#define DIO212 212
#define DIO212_BIT SPI2_CLK_BIT
#define DIO212_MUXREG SPI2_CLK_MUXREG
#define DIO212_OUT_CONFREG SPI2_CLK_OUT_CONFREG
#define DIO212_IN_CONFREG SPI2_CLK_IN_CONFREG
#define DIO212_OUTREG SPI2_CLK_OUTREG
#define DIO212_INREG SPI2_CLK_INREG
#endif
#if (defined(SPI2_SDI_BIT))
#define SPI2_SDI 213
#if (SPI2_SDI_BIT < 32)
#define SPI2_SDI_MUXREG __io_mux__(SPI2_SDI_BIT)
#define SPI2_SDI_OUT_CONFREG __io_out_conf__(SPI2_SDI_BIT)
#define SPI2_SDI_IN_CONFREG __io_in_conf__(SPI2_SDI_BIT)
#define SPI2_SDI_OUTREG OUT0
#define SPI2_SDI_INREG IN0
#else
#define SPI2_SDI_OUTREG OUT1
#define SPI2_SDI_INREG IN1
#endif
#define DIO213 213
#define DIO213_BIT SPI2_SDI_BIT
#define DIO213_MUXREG SPI2_SDI_MUXREG
#define DIO213_OUT_CONFREG SPI2_SDI_OUT_CONFREG
#define DIO213_IN_CONFREG SPI2_SDI_IN_CONFREG
#define DIO213_OUTREG SPI2_SDI_OUTREG
#define DIO213_INREG SPI2_SDI_INREG
#endif
#if (defined(SPI2_SDO_BIT))
#define SPI2_SDO 214
#if (SPI2_SDO_BIT < 32)
#define SPI2_SDO_MUXREG __io_mux__(SPI2_SDO_BIT)
#define SPI2_SDO_OUT_CONFREG __io_out_conf__(SPI2_SDO_BIT)
#define SPI2_SDO_IN_CONFREG __io_in_conf__(SPI2_SDO_BIT)
#define SPI2_SDO_OUTREG OUT0
#define SPI2_SDO_INREG IN0
#else
#define SPI2_SDO_OUTREG OUT1
#define SPI2_SDO_INREG IN1
#endif
#define DIO214 214
#define DIO214_BIT SPI2_SDO_BIT
#define DIO214_MUXREG SPI2_SDO_MUXREG
#define DIO214_OUT_CONFREG SPI2_SDO_OUT_CONFREG
#define DIO214_IN_CONFREG SPI2_SDO_IN_CONFREG
#define DIO214_OUTREG SPI2_SDO_OUTREG
#define DIO214_INREG SPI2_SDO_INREG
#endif
#if (defined(SPI2_CS_BIT))
#define SPI2_CS 215
#if (SPI2_CS_BIT < 32)
#define SPI2_CS_MUXREG __io_mux__(SPI2_CS_BIT)
#define SPI2_CS_OUT_CONFREG __io_out_conf__(SPI2_CS_BIT)
#define SPI2_CS_IN_CONFREG __io_in_conf__(SPI2_CS_BIT)
#define SPI2_CS_OUTREG OUT0
#define SPI2_CS_INREG IN0
#else
#define SPI2_CS_OUTREG OUT1
#define SPI2_CS_INREG IN1
#endif
#define DIO215 215
#define DIO215_BIT SPI2_CS_BIT
#define DIO215_MUXREG SPI2_CS_MUXREG
#define DIO215_OUT_CONFREG SPI2_CS_OUT_CONFREG
#define DIO215_IN_CONFREG SPI2_CS_IN_CONFREG
#define DIO215_OUTREG SPI2_CS_OUTREG
#define DIO215_INREG SPI2_CS_INREG
#endif

// ISR on change inputs
#if (defined(LIMIT_X_ISR) && defined(LIMIT_X))
#define DIO100_ISR (LIMIT_X_ISR)
#define LIMIT_X_ISRVAR 1
#define DIO100_ISRVAR 1
#endif
#if (defined(LIMIT_Y_ISR) && defined(LIMIT_Y))
#define DIO101_ISR (LIMIT_Y_ISR)
#define LIMIT_Y_ISRVAR 1
#define DIO101_ISRVAR 1
#endif
#if (defined(LIMIT_Z_ISR) && defined(LIMIT_Z))
#define DIO102_ISR (LIMIT_Z_ISR)
#define LIMIT_Z_ISRVAR 1
#define DIO102_ISRVAR 1
#endif
#if (defined(LIMIT_X2_ISR) && defined(LIMIT_X2))
#define DIO103_ISR (LIMIT_X2_ISR)
#define LIMIT_X2_ISRVAR 1
#define DIO103_ISRVAR 1
#endif
#if (defined(LIMIT_Y2_ISR) && defined(LIMIT_Y2))
#define DIO104_ISR (LIMIT_Y2_ISR)
#define LIMIT_Y2_ISRVAR 1
#define DIO104_ISRVAR 1
#endif
#if (defined(LIMIT_Z2_ISR) && defined(LIMIT_Z2))
#define DIO105_ISR (LIMIT_Z2_ISR)
#define LIMIT_Z2_ISRVAR 1
#define DIO105_ISRVAR 1
#endif
#if (defined(LIMIT_A_ISR) && defined(LIMIT_A))
#define DIO106_ISR (LIMIT_A_ISR)
#define LIMIT_A_ISRVAR 1
#define DIO106_ISRVAR 1
#endif
#if (defined(LIMIT_B_ISR) && defined(LIMIT_B))
#define DIO107_ISR (LIMIT_B_ISR)
#define LIMIT_B_ISRVAR 1
#define DIO107_ISRVAR 1
#endif
#if (defined(LIMIT_C_ISR) && defined(LIMIT_C))
#define DIO108_ISR (LIMIT_C_ISR)
#define LIMIT_C_ISRVAR 1
#define DIO108_ISRVAR 1
#endif
#if (defined(PROBE_ISR) && defined(PROBE))
#define DIO109_ISR (PROBE_ISR)
#define PROBE_ISRVAR 2
#define DIO109_ISRVAR 2
#endif
#if (defined(ESTOP_ISR) && defined(ESTOP))
#define DIO110_ISR (ESTOP_ISR)
#define ESTOP_ISRVAR 0
#define DIO110_ISRVAR 0
#endif
#if (defined(SAFETY_DOOR_ISR) && defined(SAFETY_DOOR))
#define DIO111_ISR (SAFETY_DOOR_ISR)
#define SAFETY_DOOR_ISRVAR 0
#define DIO111_ISRVAR 0
#endif
#if (defined(FHOLD_ISR) && defined(FHOLD))
#define DIO112_ISR (FHOLD_ISR)
#define FHOLD_ISRVAR 0
#define DIO112_ISRVAR 0
#endif
#if (defined(CS_RES_ISR) && defined(CS_RES))
#define DIO113_ISR (CS_RES_ISR)
#define CS_RES_ISRVAR 0
#define DIO113_ISRVAR 0
#endif
#if (defined(DIN0_ISR) && defined(DIN0))
#define DIO130_ISR (DIN0_ISR)
#define DIN0_ISRVAR 3
#define DIO130_ISRVAR 3
#endif
#if (defined(DIN1_ISR) && defined(DIN1))
#define DIO131_ISR (DIN1_ISR)
#define DIN1_ISRVAR 3
#define DIO131_ISRVAR 3
#endif
#if (defined(DIN2_ISR) && defined(DIN2))
#define DIO132_ISR (DIN2_ISR)
#define DIN2_ISRVAR 3
#define DIO132_ISRVAR 3
#endif
#if (defined(DIN3_ISR) && defined(DIN3))
#define DIO133_ISR (DIN3_ISR)
#define DIN3_ISRVAR 3
#define DIO133_ISRVAR 3
#endif
#if (defined(DIN4_ISR) && defined(DIN4))
#define DIO134_ISR (DIN4_ISR)
#define DIN4_ISRVAR 3
#define DIO134_ISRVAR 3
#endif
#if (defined(DIN5_ISR) && defined(DIN5))
#define DIO135_ISR (DIN5_ISR)
#define DIN5_ISRVAR 3
#define DIO135_ISRVAR 3
#endif
#if (defined(DIN6_ISR) && defined(DIN6))
#define DIO136_ISR (DIN6_ISR)
#define DIN6_ISRVAR 3
#define DIO136_ISRVAR 3
#endif
#if (defined(DIN7_ISR) && defined(DIN7))
#define DIO137_ISR (DIN7_ISR)
#define DIN7_ISRVAR 3
#define DIO137_ISRVAR 3
#endif

#define __adc_channel_helper__(X, Y) ADC##X##_CHANNEL_##Y
#define _adc_channel_helper_(X, Y) __adc_channel_helper__(X, Y)

