Paciente8159/uCNC/uCNC/src/hal/mcus/esp32s/mcumap_esp32s.h
#ifdef ANALOG0
#define ANALOG0_ADC_CHANNEL _adc_channel_helper_(ANALOG0_CHANNEL, ANALOG0_ADC)
#define DIO114_CHANNEL ANALOG0_CHANNEL
#define DIO114_ADC ANALOG0_ADC
#define DIO114_ADC_CHANNEL ANALOG0_ADC_CHANNEL
#endif
#ifdef ANALOG1
#define ANALOG1_ADC_CHANNEL _adc_channel_helper_(ANALOG1_CHANNEL, ANALOG1_ADC)
#define DIO115_CHANNEL ANALOG1_CHANNEL
#define DIO115_ADC ANALOG1_ADC
#define DIO115_ADC_CHANNEL ANALOG1_ADC_CHANNEL
#endif
#ifdef ANALOG2
#define ANALOG2_ADC_CHANNEL _adc_channel_helper_(ANALOG2_CHANNEL, ANALOG2_ADC)
#define DIO116_CHANNEL ANALOG2_CHANNEL
#define DIO116_ADC ANALOG2_ADC
#define DIO116_ADC_CHANNEL ANALOG2_ADC_CHANNEL
#endif
#ifdef ANALOG3
#define ANALOG3_ADC_CHANNEL _adc_channel_helper_(ANALOG3_CHANNEL, ANALOG3_ADC)
#define DIO117_CHANNEL ANALOG3_CHANNEL
#define DIO117_ADC ANALOG3_ADC
#define DIO117_ADC_CHANNEL ANALOG3_ADC_CHANNEL
#endif
#ifdef ANALOG4
#define ANALOG4_ADC_CHANNEL _adc_channel_helper_(ANALOG4_CHANNEL, ANALOG4_ADC)
#define DIO118_CHANNEL ANALOG4_CHANNEL
#define DIO118_ADC ANALOG4_ADC
#define DIO118_ADC_CHANNEL ANALOG4_ADC_CHANNEL
#endif
#ifdef ANALOG5
#define ANALOG5_ADC_CHANNEL _adc_channel_helper_(ANALOG5_CHANNEL, ANALOG5_ADC)
#define DIO119_CHANNEL ANALOG5_CHANNEL
#define DIO119_ADC ANALOG5_ADC
#define DIO119_ADC_CHANNEL ANALOG5_ADC_CHANNEL
#endif
#ifdef ANALOG6
#define ANALOG6_ADC_CHANNEL _adc_channel_helper_(ANALOG6_CHANNEL, ANALOG6_ADC)
#define DIO120_CHANNEL ANALOG6_CHANNEL
#define DIO120_ADC ANALOG6_ADC
#define DIO120_ADC_CHANNEL ANALOG6_ADC_CHANNEL
#endif
#ifdef ANALOG7
#define ANALOG7_ADC_CHANNEL _adc_channel_helper_(ANALOG7_CHANNEL, ANALOG7_ADC)
#define DIO121_CHANNEL ANALOG7_CHANNEL
#define DIO121_ADC ANALOG7_ADC
#define DIO121_ADC_CHANNEL ANALOG7_ADC_CHANNEL
#endif
#ifdef ANALOG8
#define ANALOG8_ADC_CHANNEL _adc_channel_helper_(ANALOG8_CHANNEL, ANALOG8_ADC)
#define DIO122_CHANNEL ANALOG8_CHANNEL
#define DIO122_ADC ANALOG8_ADC
#define DIO122_ADC_CHANNEL ANALOG8_ADC_CHANNEL
#endif
#ifdef ANALOG9
#define ANALOG9_ADC_CHANNEL _adc_channel_helper_(ANALOG9_CHANNEL, ANALOG9_ADC)
#define DIO123_CHANNEL ANALOG9_CHANNEL
#define DIO123_ADC ANALOG9_ADC
#define DIO123_ADC_CHANNEL ANALOG9_ADC_CHANNEL
#endif
#ifdef ANALOG10
#define ANALOG10_ADC_CHANNEL _adc_channel_helper_(ANALOG10_CHANNEL, ANALOG10_ADC)
#define DIO124_CHANNEL ANALOG10_CHANNEL
#define DIO124_ADC ANALOG10_ADC
#define DIO124_ADC_CHANNEL ANALOG10_ADC_CHANNEL
#endif
#ifdef ANALOG11
#define ANALOG11_ADC_CHANNEL _adc_channel_helper_(ANALOG11_CHANNEL, ANALOG11_ADC)
#define DIO125_CHANNEL ANALOG11_CHANNEL
#define DIO125_ADC ANALOG11_ADC
#define DIO125_ADC_CHANNEL ANALOG11_ADC_CHANNEL
#endif
#ifdef ANALOG12
#define ANALOG12_ADC_CHANNEL _adc_channel_helper_(ANALOG12_CHANNEL, ANALOG12_ADC)
#define DIO126_CHANNEL ANALOG12_CHANNEL
#define DIO126_ADC ANALOG12_ADC
#define DIO126_ADC_CHANNEL ANALOG12_ADC_CHANNEL
#endif
#ifdef ANALOG13
#define ANALOG13_ADC_CHANNEL _adc_channel_helper_(ANALOG13_CHANNEL, ANALOG13_ADC)
#define DIO127_CHANNEL ANALOG13_CHANNEL
#define DIO127_ADC ANALOG13_ADC
#define DIO127_ADC_CHANNEL ANALOG13_ADC_CHANNEL
#endif
#ifdef ANALOG14
#define ANALOG14_ADC_CHANNEL _adc_channel_helper_(ANALOG14_CHANNEL, ANALOG14_ADC)
#define DIO128_CHANNEL ANALOG14_CHANNEL
#define DIO128_ADC ANALOG14_ADC
#define DIO128_ADC_CHANNEL ANALOG14_ADC_CHANNEL
#endif
#ifdef ANALOG15
#define ANALOG15_ADC_CHANNEL _adc_channel_helper_(ANALOG15_CHANNEL, ANALOG15_ADC)
#define DIO129_CHANNEL ANALOG15_CHANNEL
#define DIO129_ADC ANALOG15_ADC
#define DIO129_ADC_CHANNEL ANALOG15_ADC_CHANNEL
#endif

	/*PWM's*/

#ifdef PWM0_CHANNEL
#define PWM0_LEDCCHANNEL (PWM0_CHANNEL & 0x07)
#if (PWM0_CHANNEL < 8) && SOC_LEDC_SUPPORT_HS_MODE
#define PWM0_SPEEDMODE LEDC_HIGH_SPEED_MODE
#else
#define PWM0_SPEEDMODE LEDC_LOW_SPEED_MODE
#endif
#define DIO25_CHANNEL PWM0_CHANNEL
#define DIO25_TIMER PWM0_TIMER
#define DIO25_LEDCCHANNEL PWM0_LEDCCHANNEL
#define DIO25_SPEEDMODE PWM0_SPEEDMODE
#endif
#ifdef PWM1_CHANNEL
#define PWM1_LEDCCHANNEL (PWM1_CHANNEL & 0x07)
#if (PWM1_CHANNEL < 8) && SOC_LEDC_SUPPORT_HS_MODE
#define PWM1_SPEEDMODE LEDC_HIGH_SPEED_MODE
#else
#define PWM1_SPEEDMODE LEDC_LOW_SPEED_MODE
#endif
#define DIO26_CHANNEL PWM1_CHANNEL
#define DIO26_TIMER PWM1_TIMER
#define DIO26_LEDCCHANNEL PWM1_LEDCCHANNEL
#define DIO26_SPEEDMODE PWM1_SPEEDMODE
#endif
#ifdef PWM2_CHANNEL
#define PWM2_LEDCCHANNEL (PWM2_CHANNEL & 0x07)
#if (PWM2_CHANNEL < 8) && SOC_LEDC_SUPPORT_HS_MODE
#define PWM2_SPEEDMODE LEDC_HIGH_SPEED_MODE
#else
#define PWM2_SPEEDMODE LEDC_LOW_SPEED_MODE
#endif
#define DIO27_CHANNEL PWM2_CHANNEL
#define DIO27_TIMER PWM2_TIMER
#define DIO27_LEDCCHANNEL PWM2_LEDCCHANNEL
#define DIO27_SPEEDMODE PWM2_SPEEDMODE
#endif
#ifdef PWM3_CHANNEL
#define PWM3_LEDCCHANNEL (PWM3_CHANNEL & 0x07)
#if (PWM3_CHANNEL < 8) && SOC_LEDC_SUPPORT_HS_MODE
#define PWM3_SPEEDMODE LEDC_HIGH_SPEED_MODE
#else
#define PWM3_SPEEDMODE LEDC_LOW_SPEED_MODE
#endif
#define DIO28_CHANNEL PWM3_CHANNEL
#define DIO28_TIMER PWM3_TIMER
#define DIO28_LEDCCHANNEL PWM3_LEDCCHANNEL
#define DIO28_SPEEDMODE PWM3_SPEEDMODE
#endif
#ifdef PWM4_CHANNEL
#define PWM4_LEDCCHANNEL (PWM4_CHANNEL & 0x07)
#if (PWM4_CHANNEL < 8) && SOC_LEDC_SUPPORT_HS_MODE
#define PWM4_SPEEDMODE LEDC_HIGH_SPEED_MODE
#else
#define PWM4_SPEEDMODE LEDC_LOW_SPEED_MODE
#endif
#define DIO29_CHANNEL PWM4_CHANNEL
#define DIO29_TIMER PWM4_TIMER
#define DIO29_LEDCCHANNEL PWM4_LEDCCHANNEL
#define DIO29_SPEEDMODE PWM4_SPEEDMODE
#endif
#ifdef PWM5_CHANNEL
#define PWM5_LEDCCHANNEL (PWM5_CHANNEL & 0x07)
#if (PWM5_CHANNEL < 8) && SOC_LEDC_SUPPORT_HS_MODE
#define PWM5_SPEEDMODE LEDC_HIGH_SPEED_MODE
#else
#define PWM5_SPEEDMODE LEDC_LOW_SPEED_MODE
#endif
#define DIO30_CHANNEL PWM5_CHANNEL
#define DIO30_TIMER PWM5_TIMER
#define DIO30_LEDCCHANNEL PWM5_LEDCCHANNEL
#define DIO30_SPEEDMODE PWM5_SPEEDMODE
#endif
#ifdef PWM6_CHANNEL
#define PWM6_LEDCCHANNEL (PWM6_CHANNEL & 0x07)
#if (PWM6_CHANNEL < 8) && SOC_LEDC_SUPPORT_HS_MODE
#define PWM6_SPEEDMODE LEDC_HIGH_SPEED_MODE
#else
#define PWM6_SPEEDMODE LEDC_LOW_SPEED_MODE
#endif
#define DIO31_CHANNEL PWM6_CHANNEL
#define DIO31_TIMER PWM6_TIMER
#define DIO31_LEDCCHANNEL PWM6_LEDCCHANNEL
#define DIO31_SPEEDMODE PWM6_SPEEDMODE
#endif
#ifdef PWM7_CHANNEL
#define PWM7_LEDCCHANNEL (PWM7_CHANNEL & 0x07)
#if (PWM7_CHANNEL < 8) && SOC_LEDC_SUPPORT_HS_MODE
#define PWM7_SPEEDMODE LEDC_HIGH_SPEED_MODE
#else
#define PWM7_SPEEDMODE LEDC_LOW_SPEED_MODE
#endif
#define DIO32_CHANNEL PWM7_CHANNEL
#define DIO32_TIMER PWM7_TIMER
#define DIO32_LEDCCHANNEL PWM7_LEDCCHANNEL
#define DIO32_SPEEDMODE PWM7_SPEEDMODE
#endif
#ifdef PWM8_CHANNEL
#define PWM8_LEDCCHANNEL (PWM8_CHANNEL & 0x07)
#if (PWM8_CHANNEL < 8) && SOC_LEDC_SUPPORT_HS_MODE
#define PWM8_SPEEDMODE LEDC_HIGH_SPEED_MODE
#else
#define PWM8_SPEEDMODE LEDC_LOW_SPEED_MODE
#endif
#define DIO33_CHANNEL PWM8_CHANNEL
#define DIO33_TIMER PWM8_TIMER
#define DIO33_LEDCCHANNEL PWM8_LEDCCHANNEL
#define DIO33_SPEEDMODE PWM8_SPEEDMODE
#endif
#ifdef PWM9_CHANNEL
#define PWM9_LEDCCHANNEL (PWM9_CHANNEL & 0x07)
#if (PWM9_CHANNEL < 8) && SOC_LEDC_SUPPORT_HS_MODE
#define PWM9_SPEEDMODE LEDC_HIGH_SPEED_MODE
#else
#define PWM9_SPEEDMODE LEDC_LOW_SPEED_MODE
#endif
#define DIO34_CHANNEL PWM9_CHANNEL
#define DIO34_TIMER PWM9_TIMER
#define DIO34_LEDCCHANNEL PWM9_LEDCCHANNEL
#define DIO34_SPEEDMODE PWM9_SPEEDMODE
#endif
#ifdef PWM10_CHANNEL
#define PWM10_LEDCCHANNEL (PWM10_CHANNEL & 0x07)
#if (PWM10_CHANNEL < 8) && SOC_LEDC_SUPPORT_HS_MODE
#define PWM10_SPEEDMODE LEDC_HIGH_SPEED_MODE
#else
#define PWM10_SPEEDMODE LEDC_LOW_SPEED_MODE
#endif
#define DIO35_CHANNEL PWM10_CHANNEL
#define DIO35_TIMER PWM10_TIMER
#define DIO35_LEDCCHANNEL PWM10_LEDCCHANNEL
#define DIO35_SPEEDMODE PWM10_SPEEDMODE
#endif
#ifdef PWM11_CHANNEL
#define PWM11_LEDCCHANNEL (PWM11_CHANNEL & 0x07)
#if (PWM11_CHANNEL < 8) && SOC_LEDC_SUPPORT_HS_MODE
#define PWM11_SPEEDMODE LEDC_HIGH_SPEED_MODE
#else
#define PWM11_SPEEDMODE LEDC_LOW_SPEED_MODE
#endif
#define DIO36_CHANNEL PWM11_CHANNEL
#define DIO36_TIMER PWM11_TIMER
#define DIO36_LEDCCHANNEL PWM11_LEDCCHANNEL
#define DIO36_SPEEDMODE PWM11_SPEEDMODE
#endif
#ifdef PWM12_CHANNEL
#define PWM12_LEDCCHANNEL (PWM12_CHANNEL & 0x07)
#if (PWM12_CHANNEL < 8) && SOC_LEDC_SUPPORT_HS_MODE
#define PWM12_SPEEDMODE LEDC_HIGH_SPEED_MODE
#else
#define PWM12_SPEEDMODE LEDC_LOW_SPEED_MODE
#endif
#define DIO37_CHANNEL PWM12_CHANNEL
#define DIO37_TIMER PWM12_TIMER
#define DIO37_LEDCCHANNEL PWM12_LEDCCHANNEL
#define DIO37_SPEEDMODE PWM12_SPEEDMODE
#endif
#ifdef PWM13_CHANNEL
#define PWM13_LEDCCHANNEL (PWM13_CHANNEL & 0x07)
#if (PWM13_CHANNEL < 8) && SOC_LEDC_SUPPORT_HS_MODE
#define PWM13_SPEEDMODE LEDC_HIGH_SPEED_MODE
#else
#define PWM13_SPEEDMODE LEDC_LOW_SPEED_MODE
#endif
#define DIO38_CHANNEL PWM13_CHANNEL
#define DIO38_TIMER PWM13_TIMER
#define DIO38_LEDCCHANNEL PWM13_LEDCCHANNEL
#define DIO38_SPEEDMODE PWM13_SPEEDMODE
#endif
#ifdef PWM14_CHANNEL
#define PWM14_LEDCCHANNEL (PWM14_CHANNEL & 0x07)
#if (PWM14_CHANNEL < 8) && SOC_LEDC_SUPPORT_HS_MODE
#define PWM14_SPEEDMODE LEDC_HIGH_SPEED_MODE
#else
#define PWM14_SPEEDMODE LEDC_LOW_SPEED_MODE
#endif
#define DIO39_CHANNEL PWM14_CHANNEL
#define DIO39_TIMER PWM14_TIMER
#define DIO39_LEDCCHANNEL PWM14_LEDCCHANNEL
#define DIO39_SPEEDMODE PWM14_SPEEDMODE
#endif
#ifdef PWM15_CHANNEL
#define PWM15_LEDCCHANNEL (PWM15_CHANNEL & 0x07)
#if (PWM15_CHANNEL < 8) && SOC_LEDC_SUPPORT_HS_MODE
#define PWM15_SPEEDMODE LEDC_HIGH_SPEED_MODE
#else
#define PWM15_SPEEDMODE LEDC_LOW_SPEED_MODE
#endif
#define DIO40_CHANNEL PWM15_CHANNEL
#define DIO40_TIMER PWM15_TIMER
#define DIO40_LEDCCHANNEL PWM15_LEDCCHANNEL
#define DIO40_SPEEDMODE PWM15_SPEEDMODE
#endif

#if (defined(TX) && defined(RX))
#define MCU_HAS_UART
#ifndef UART_PORT
#define UART_PORT 0
#endif
#endif
#if (defined(TX2) && defined(RX2))
#define MCU_HAS_UART2
#ifndef UART2_PORT
#define UART2_PORT 0
#endif
#ifndef BAUDRATE2
#define BAUDRATE2 BAUDRATE
#endif
#endif
#if (defined(USB_DP) && defined(USB_DM))
#define MCU_HAS_USB
#endif
#ifdef ENABLE_WIFI
#define MCU_HAS_WIFI
#ifndef DISABLE_ENDPOINTS
#define MCU_HAS_ENDPOINTS
#endif
#ifndef DISABLE_WEBSOCKETS
#define MCU_HAS_WEBSOCKETS
#endif
#ifndef BOARD_HAS_CUSTOM_SYSTEM_COMMANDS
#define BOARD_HAS_CUSTOM_SYSTEM_COMMANDS
#endif
#endif
#ifdef ENABLE_BLUETOOTH
#define MCU_HAS_BLUETOOTH
#ifndef BOARD_HAS_CUSTOM_SYSTEM_COMMANDS
#define BOARD_HAS_CUSTOM_SYSTEM_COMMANDS
#endif
#endif

// servo timer is also used by emulated PWM if used
#ifndef SERVO_TIMER
#define SERVO_TIMER 1
#endif
#define SERVO_TIMER_TG (SERVO_TIMER & 0x01)
#define SERVO_TIMER_IDX ((SERVO_TIMER >> 1) & 0x01)

#ifndef ITP_TIMER
#define ITP_TIMER 3
#endif
#define ITP_TIMER_TG (ITP_TIMER & 0x01)
#define ITP_TIMER_IDX ((ITP_TIMER >> 1) & 0x01)

